{"english_language_vocab": ["yawning", "irish", "scottish", "brazilian", "cant", "gasper", "right", "baskey", "continental", "expensive", "cost", "some", "breath", "meant", "hotel", "please", "freakin", "hm", "kitchen", "minuet", "afghan", "type", "vegetarian", "west", "awesome", "euro", "mail", "lebanese", "free", "thai", "wiscon", "darling", "serves", "polish", "catalanian", "jesus", "worth", "correct", "are", "laughing", "english", "cross", "african", "alternative", "thats", "kosher", "unintelligible", "though", "price", "other", "forget", "unintelligent", "sea", "scandinavian", "centre", "cannabis", "bye", "fuck", "north", "chesterton", "street", "choice", "available", "polynesian", "request", "indian", "they", "surprise", "crosstalk", "castro", "yes", "town", "signaporian", "mediterranean", "indians", "inner", "am", "turkish", "fen", "ok", "great", "endonesian", "ecuadorean", "meditteranian", "hi", "yeah", "tow", "pub", "luck", "holy", "crossover", "any", "at", "out", "whats", "restaurant", "offer", "ran", "name", "world", "moderately", "pizza", "venues", "it", "not", "can", "wha", "shows", "viet", "selection", "tasty", "venison", "south", "burger", "previews", "rest", "moron", "repeat", "portugese", "perfect", "modernity", "list", "christ", "port", "train", "so", "fusion", "caribbean", "bra", "serving", "much", "labenese", "zip", "mexican", "result", "find", "ad", "hello", "first", "halo", "garden", "else", "modern_european", "address", "spice", "no", "kay", "sure", "re", "one", "gastro", "sigh", "adress", "catalan", "postal", "fast", "excellent", "nice", "that", "dont", "pick", "thank", "their", "east", "but", "god", "knocking", "chinese", "unusual", "oriental", "music", "persian", "christmas", "german", "newmarket", "sorry", "pollynasian", "code", "goodbye", "baskaye", "bar", "euorpean", "mediteranian", "don't", "should", "art", "mediteranean", "college", "salad", "foo", "turk", "cute", "phone", "suggestions", "cool", "number", "is", "confirm", "modreately", "takes", "nt", "afternoon", "foods", "germ", "options", "bat", "scotch", "anywhere", "basque", "time", "french", "road", "welsh", "food", "venetian", "cantonese", "austrian", "hindi", "sec", "grill", "dress", "inaudible", "appleton", "singaporean", "kind", "leban", "an", "over", "austro", "european", "australasian", "the", "class", "peace", "or", "restuarant", "mmhm", "area", "swedish", "signature", "very", "creative", "traditional", "welcome", "hey", "moderate", "post", "air", "promo", "start", "dear", "australian", "help", "austallison", "steak", "cheap", "different", "feed", "uh", "spanish", "day", "central", "cow", "loo", "such", "try", "talk", "what", "mistakes", "takeaway", "priced", "answer", "another", "last", "ko", "information", "ranges", "just", "north_american", "arts", "blow", "malaysian", "singapore", "city", "there", "restaurants", "moroccan", "have", "romanian", "next", "because", "bask", "jamaica", "british", "canopus", "halal", "cough", "alright", "bistro", "cherries", "nor", "care", "ind", "back", "new", "and", "good", "postcode", "italian", "oh", "gastropub", "magdalene", "ya", "indo", "europea", "moment", "rage", "pricerange", "then", "in", "jamcian", "seafood", "we", "addresses", "talking", "gardens", "turkey", "swiss", "serve", "on", "option", "sock", "something", "ger", "of", "um", "water", "side", "for", "tuscan", "breathing", "anything", "ah", "you", "belgian", "me", "none", "korean", "bart", "panasian", "i", "than", "part", "looking", "modern", "wait", "hungarian", "eritrean", "park", "canape", "india", "matter", "american", "nosie", "austral", "regent", "aw", "asian", "recommend", "popular", "welch", "get", "house", "telephone", "ooh", "greek", "suggestion", "tur", "reset", "river", "location", "7:30", "international", "huh", "steakhouse", "ital", "mind", "danish", "see", "indonesian", "dish", "well", "vietnamese", "portuguese", "was", "damn", "center", "medterranean", "range", "areas", "asian_oriental", "jamaican", "place", "bad", "to", "prices", "medium", "with", "barbecue", "worthless", "thanks", "change", "dr", "umh", "barbeque", "yea", "system", "okay", "russian", "japanese", "cuban", "ring", "prise", "fucking"], "native_language_vocab": ["aaganum", "onum", "check", "malivaana", "athula", "solludhu", "kudukkara", "vai", "anthu", "venalum", "ithu", "idu", "pannanum.", "tharingla", "kamega", "theditiruken", "vendam", "Sorry.", "unglaala", "dhan", "paerai", "addres", "pathitu", "pari", "panra.", "na", "pannuva", "yannachu", "thedren", "kitta", "theriyathu", "parimaranga", "amainthathaahum.", "siringa", "innoru", "nalathu", "rangeu", "onnum", "irrukara", "tedikkondu", "L.E", "pricela", "mudithuvitten", "athan", "bedouin", "ilai", "yepdi", "thedalanam", "peyan", "parrkuren.", "parthitu", "D.P", "unnidam", "enga", "mattum", "irruka", "thedugiren", "anatolia", "illa.", "varaverkiradhu", "vil.", "pagudiala", "panran", "tholaindadu.", "parrkkiren.", "ellam", "Ok.", "aanadha", "venuma", "uga", "codum", "ethu", "kandupudi", "anal", "theavilla", "paakuren.", "maiyattil", "kohinoor", "pakkarathu", "unna", "nandri", "thedi", "irukaen", "edhavadhu", "enna", "ella", "sonnengala", "pantranga", "irukiren", "abiprayam.", "adu", "evalo", "kavalai", "edidam.", "matha", "pakadhula", "mudiyala", "yanachu", "thedindrikaenga", "kadaikkuma", "maiya", "mudivu", "kidaikuma", "unnum", "panda", "virupam", "maathidunga", "kidaikum", "kammi", "ennkau", "kudukara", "parkireen", "pannale.", "pathirukiya", "system.", "irrukkangala.", "theditirukan", "intha", "avage", "ungalukku", "eapadi", "kula", "eruku", "irunthen", "irukara", "parthukkondirukkoren.", "pannra", "foodah", "ena", "edavadu", "ceyya", "irukuratha", "kedaikra", "eanna", "nandos", "thaan.", "ientha", "kandupidikka", "pinnadi", "lam", "inondru", "nakaram", "paravalaya", "virumburen", "thavira", "unta", "ayirkara", "tedukiren", "irukira", "ooru", "theaduren", "kedaikara", "thedu", "mari", "pannikaren", "pidikanum", "parthutu", "westill", "vanakkam", "avanga", "engum", "parkkiren.", "irukken.", "interest", "kedaikuma", "vendaam.", "cuisine", "pannunga.", "tholaipesi", "aga", "unnai", "trum", "avarkal", "nagara", "partthuttu", "inda", "sidela", "odu", "irukaa", "enaku", "maari", "theduraen", "ethevathu", "adutha", "pattri", "avalothaa", "kooduvaga", "pannuvanga", "irrukuma", "naanu", "pannum", "la", "avargal", "vagai", "cusine", "pudikum", "modhal", "sollaringla", "vilum", "avlathaan", "aana", "parrkukiren.", "namaku", "saidhu", "our", "numberum", "unavakathirku", "idathula", "pidithu", "edachum", "oda", "kadaikkumaa", "pudisu", "sollamudiyuma", "erukanum", "vechurkanga", "centerla", "cUISINE", "va", "adhai", "yennakku", "sapidanum", "parimarukiraarkal", "nagaram", "yinga", "yenna", "tayavu", "leya", "call", "panahar", "ennamo", "aanaal", "poduvangala", "kedaikaramadiri", "irunthuchu", "poituva", "thanae", "C.B", "ongaluku", "marupadiyum", "edhachu", "cheappricela", "paguthila", "lenthu", "illai", "mudithuviten.", "athode", "niruthu", "indha", "resturant", "unavai", "townla", "ninaikiren.", "enaa", "yankau", "restaurant.Athoda", "aw.", "vandhurukaanga", "yenge", "ethavuthu", "mathriyana", "irukka", "kulla", "yarudaiyadhu", "eh", "abiprayam", "aprom", "restauraunt", "vil", "thevayana", "ilavasa", "vere", "unavu.", "irundhaalaum", "irundudhu", "mudinjadhu", "paarthukittu", "pooitu", "kittu", "niraya", "uthavukintra", "restauran", "enthavthu", "matra", "irukanom", "edha", "vechukalaama", "ktte", "apram", "epdi", "unavagam", "kekka", "sonna", "irukken", "Sure.", "amount", "parthukkondirukkien.", "thedindriken", "aamam", "anaku", "irukaanga", "paakuren", "vechirukenga", "kaduvulae", "konjam", "pathutu", "pananga", "adressum", "panradha", "appuram", "maiyaththil", "parkareenga", "expensiveprice", "paarkiraen", "therinjukalaama", "virumbavillai", "adhavudhu", "irukkira", "venue", "prachanai", "meghna", "tholai", "ennava", "enda", "edhuvume", "paarthu", "antha", "thara", "mudichachu", "pidikanom", "ethaavthu", "idam", "naa", "vendum", "aanalum", "pannudha", "mannikkavum", "dhayavuseithu", "pannale", "namma", "panla.", "phonenumber", "maadiri", "avungaloda", "theriyanum", "kadaikuma", "mathikitan", "hut", "virppanai", "pannanga", "pidikkum", "pakalam", "unnmaiyil", "kudungu", "irkuku", "orthar", "athalam", "parimaruvaga", "parkkuren", "kondirukkiren", "kidaikkuma.", "pandra", "care.", "maiyam", "solringala", "thedittu", "thedindu", "kaga", "mika", "sumar", "ummoderate", "puthu", "idhukulaye", "nadutharama", "irukkaratha", "irrukalam", "koodiya", "vangikiran", "sollu", "paguthi", "idathhil", "kidaikumaa", "anga", "eppa", "thedikkondirukkiren.", "pudikanum", "pidikum", "yosichittu", "pannindriken", "kandupidika", "seiyun", "vechitiya", "sumarana", "pannura", "naduvil", "eddathil", "gye", "veru", "idhu", "nanraga", "adressah", "ippo", "romba", "paduvathillai.", "innum", "thedikitu", "irukkanum.", "il", "sila", "isai", "avanka", "anjal", "sollunga.", "yennakky", "mathiri", "evalavu", "illena", "nenaikuringa", "panalama", "thedukirarkal.", "adhuvum", "ullathu", "engala", "ila", "ninkal", "kadavule", "panla", "parthukkondirukkiren", "layum", "enakku", "ille", "irku", "vishiyamea", "yai", "enakku..", "ennachi", "ullathu.", "vanakam", "neengal", "apuram", "illai.Enakku", "idathil", "cheapprice", "theriyadhu", "meedhi", "munnadi", "venum", "pakuthi", "ulla", "N.F", "adhuku", "pidichu", "thedanum", "yetha", "onru", "thedikkondirukkiren", "oru", "seiyum", "pannanum", "pannirukaga", "parthutuirukken", "yedhavadhu", "virumbuvathu", "uavu", "tai", "paakraen", "arumaiyana", "parkiraen", "thariya", "irundhalum", "edhavadu", "kuriyeedu", "paarungalaen", "pannalama", "anvangloda", "pricerangerum", "adanudai", "marandhudu", "patthi", "amaa", "ulladu", "niikkira", "apo", "irukatum", "pannera", "angu", "eathavathu", "alathukum", "it.", "vilai", "mudiuma", "parthuttu", "yedam", "ungakitta", "pana", "final", "ilana", "kandupudika", "m\u012bntum", "etahvthu", "seiravar", "normal", "kammiyana", "paarka", "athu", "adhumathiri", "thattaren", "parkkalam", "saadharnamana", "kudu", "mudiyuma", "athai", "pantra", "nenakaren", "parkiren.", "paravayillai", "sell", "avargaludaya", "etha", "eppo", "center'la", "edhavuthu", "ai", "yaaravadhu", "nenaikaringa", "pannikaren.", "udan", "parimaru", "paakuraen", "seykirathu", "poitu", "kedaikira", "thavaru", "adhu", "ganja", "yentha", "marupadium", "apparam", "sari", "adddress", "arla", "kandupudikanu", "nanri", "mathri", "nallathu", "puriyatha", "endha", "mataen", "irukagala", "uf", "nann", "kymmoy", "parkatha", "ennathu", "prezzo", "irukkiren.", "vikkara", "ipa", "edathil", "eraina", "kadacha", "pleasde", "parthukkuturukkaren.", "pannunga", "pannituirukiringala", "ethana", "le", "nall", "pakuti", "pannuvangala", "panitu", "irukku", "thedikkondu", "avalothan", "ayitten.", "pera", "parrkukiren", "thaan", "aaciya", "velai", "pakam", "eirukka", "irukkura", "irukkanam", "colvatu", "entha", "nalladhu", "erukku", "matrum", "sapadu", "oorukulla", "aachu", "thedukiren.", "nagarathin", "Enna.", "midhamaana", "iruken", "mayathil", "&", "avarudaiya", "thedindi", "code.", "thedalanam.", "yetho", "you.", "restaurantaa", "mudiyaadhu", "oorla", "kavala", "mudiyum", "evvalavu", "maarikaran", "restaurantum", "edho", "thirupi", "vaangi", "parimaarukireerkal", "virumpurkiren", "ninaikkira", "irukardhu", "irukanu", "kandu", "vum", "medium.", "ym", "edhavdu", "ninakira", "vendum.", "edu", "dai", "theduren", "ait", "paravala", "restauraant", "vandhu", "kandupudikanum", "naanum", "anthamari", "aaga", "erukein", "visayamey", "irukanum", "paravaillai", "a.", "eruka", "enge", "solunga", "resataurant", "naalum", "ennai", "parkavum", "ondru", "yethathu", "ennidam", "padugiren", "venam.", "pone", "vagaikal", "oo", "viruppam", "idam.", "confuse", "irrukkirathu.", "pannravanga", "prachanaillai", "ungal", "nalum", "maaththidunga", "centralla", "ungaluku", "irrukum", "midhaamaana", "vndum", "paravailla", "cotto", "virumpuren", "pakkaren", "pananum", "pol", "parthukkondirukkirom.", "kandupidikanum", "vunga", "pa", "mat", "ennaa", "iruka", "naan", "virumbugiren.", "ondu", "aparam", "graffiti", "onnu", "chinesefood", "virumbukiren", "virumbuven", "irukku.", "goodbye.", "tharingala", "kooda", "vill", "varyan", "yenaku", "edhavudhu", "unavakam", "vendaam", "eapdai", "tevai", "pannanga.", "thiripiyum", "addressah", "madiri", "marubadiyum", "kitaikkuma", "avangaloda", "pannuyaangala", "irukura", "townukku", "athuku", "edathula", "vena", "vechirukanga", "enuku", "panren.", "ask", "iddathil", "irunga", "parthukittu", "ayyo", "valanga", "koodia", "pathukkondirukkiren", "kidaikkum", "solluran", "sonne", "vilai.", "italians", "vangithara", "rightu", "seiya", "kavalaipadavillai", "virupam.", "pannu", "unga", "thevai.", "irukunu", "mudinjidhu", "irunth", "illai.", "kekirata", "unavin", "kediakuma", "andha", "parrkiren.", "irukean", "pannurathu", "kavalayum", "parkkiren", "sevai", "pannalai", "pakkurathu", "panraya", "panradhu", "illaya", "eddavadu", "paakuran", "kudukamudiyuma", "kandupidikkanum", "ethavthu", "nakara", "naduvula", "pannatha", "uyarntha", "sumaarana", "vietnamesefood", "enathu", "eduthutu", "paakaren", "piddikkum", "dhaivu", "pattri.", "rajmahal", "irukkanum", "appadiya", "thedalam", "sale", "sariya", "idil", "kkaga.", "nilaiyanathu", "aprama", "kodunga.", "edathu", "dhane", "enoda", "deri", "vandhuruka", "valakama", "athuvum", "varugiraen", "illati", "thirippi", "thuridha", "seiven", "panudhu", "resttaurant", "vennalume", "marum", "mudiyaathu", "ungaludalya", "pidikala", "thedugiren.", "seriya", "saapadu", "ula", "restaurantla", "asai", "yenakku", "apparum", "avlothan", "virumbugira", "kaaka", "eppadi", "ennala", "avunga", "kudango.", "addressum", "pidikkanum", "koli", "unavu", "ondrai", "sirichitte", "iruku", "edavadhu", "aa", "kudukka", "ethavathu", "soluga", "cirapu", "nagarin", "vera", "maadri", "parimaarum", "yennaku", "pannuma", "umcheap", "pannuvaanga", "appadi", "epadi", "vithamana", "enak", "adhellam", "restraurant", "irukuma", "ana", "atan", "piriya", "mendum", "panuvangala", "abipprayam.", "foodunu", "venum.", "mithamaana", "ethuva", "kandupidikanam", "appadinna", "parka", "pazhasu", "udavukiradu", "epudi", "pidika", "thedikondirukkiren", "irukkum", "thaaney", "vangi", "panna", "thedreenga", "panuvaga", "anapu", "yathu", "varaverkiradhu.", "enne", "illana", "eppadiu", "irruken", "bye.", "kaangiren", "mudium", "chiquitovoda", "paathitu", "virumbugiren", "vilaiyil", "kodunkal", "asaipaduran", "galleria", "paguthiyil", "apayeum", "kelu", "sOLUGA", "avvalavu", "vidhamana", "ennal", "ullatha", "paathutu", "thirumba", "nakarin", "yeppadi", "pakaren", "part.", "paguthilam", "mm", "theriyannum.", "naduthara", "pakkam", "solla", "anku", "kudunga", "thedaren", "townum", "edhaavadhu", "pudikalam", "amam", "valadhu", "ammam", "seiyya", "enakkuv", "panrangala", "paarkuraen", "partla", "nanna", "nalla", "please.", "mikka", "maathiri", "yor", "onu", "uthavi", "thedukiren", "aagalaama", "ninaikkareenga", "arivattra", "yengae", "food'ku", "vizhayame", "vela", "yendral", "kavali", "nadutharamana", "sorry.", "ethir", "pakura", "ilavasam", "appram", "kidaikkuma", "avlo", "thedukirean.", "cocum", "parkiren", "ungalai", "kidakuma", "ethavdu", "seri", "nala", "pathukkondirukkiren.", "serve.", "paravai", "uh!", "ennadhu", "adanudaiexpensive", "virkum", "naatu", "idhuku", "therinjikalama", "moderative", "thervu", "nallairukum", "yoda", "agudhu", "ona", "kadupudikanu", "enna.", "pandreengala", "irukuramathiri", "vandu", "nandri.", "kadaikuuma", "paguthigalai", "ille.", "pin", "edhaachu", "thevai", "madhiri", "yannaku", "restaurant.", "adhum", "aama", "vagaiyana", "solaringla", "venam", "yanuku", "avaroda", "areala", "adha", "errukein.", "nnan", "illa", "nampuren", "alavu", "rendum", "thaane", "keadakuma", "parkkuren.", "yarathu", "thaana", "ishtam", "available.", "yathana", "thayda", "parimarum", "kudukkura", "udaya", "mayam", "kodunga", "irrukanum", "ninaikkareenga.", "kudukkanum", "suvaya", "mugavari", "irukum", "pannara", "poruttu", "maataen", "aam", "ki\u1e6daikkuma", "paakareenga", "nariya", "innonnu", "theriyum", "ennaku", "ungaloda", "lum", "matri", "yanna", "parrkkiren", "sollunga", "thirumbavum", "vidai", "irukkirathu", "endru", "pathi", "meendum", "kuduka", "kedaikum", "westla", "hakka", "thrinja", "layachum", "yethavathu", "nee", "venda", "kidaikira", "irkane", "thedikittu", "en", "paniyatra", "athoda", "kandipaga", "panudha", "yarakavathu", "varuga", "appo", "seithu", "pramadhamana", "ethuvume", "ange", "yanaku", "ungalathu", "irunthalum", "parthukkondirukkien", "hmmm", "adhoda", "basis", "thapu", "amaam", "panra", "foodaa", "itha", "un", "parthukkondirukkiren.", "pincode", "sirantha", "il.", "ethavatu", "irukan", "pannalum", "parkaren", "edu.", "ennuku", "avarkalin", "food.", "theriya", "kudukaringla", "vula", "eratrain", "pakkuren", "avangloda", "unaku", "arambi", "saapaadu", "aingae", "irundha", "mudiyathu", "pudichuruku", "U.F", "varaikum", "parkaren.", "inga", "irukka.", "podhum", "yena", "madri", "ok.", "ungaludaiya", "ethuvum", "kaathiru", "pandradha", "vennum", "kodungal", "parava", "americas", "muyarchithu", "ku", "kondu", "allathu", "taringala", "restaurantah", "south'la", "nadupara", "yum", "vachukalma", "karutu", "pannitu", "parunga", "idama", "cote", "aayiduchu", "ippothikku", "therinjukanum", "ethavathi", "kodupaanga", "illaiya", "theditu", "thayavu", "towm", "aanadhu", "yevvalavu", "yenna.", "hmm", "atai", "ithoda", "patri", "nan", "ethachum", "maadhiri", "ceytu", "pakkathula", "selavaagum.", "parimaruvadhu", "pona", "pudhiya", "atha", "venalume", "irruku", "pothum", "paravaala", "yenakum", "wagamama", "kita", "thanga", "moderateah", "mattrum", "engal", "kidaikra", "saapadau", "pathundriken", "udiya", "paththi", "theriyuma", "parrkkuren", "edam", "pATHI", "ama", "aduthu", "panranga", "illatha", "theda", "mutiyum", "irukurathala", "parhukkondirukkiren.", "neenga", "irukiratha", "thedikondu", "restauranteast", "locationla", "oruvela", "pannatuma", "amaintha", "alla.", "pakuren", "kiadikkuma", "vaenum", "pesi", "nadula", "nallum", "ninaikira"], "others_vocab": ["the_river_bar_steakhouse_and_grill_phone", "R_rating", "cambridge_lodge_restaurant_post_code", "pizza_hut_fen_ditton_address", "restaurant_alimentum_post_code", "royal_spice_address", "108", "city_stop_restaurant", "shiraz_restaurant", "sesame_restaurant_and_bar_phone", "9", "darrys_cookhouse_and_wine_shop_address", "curry_king_phone", "city_stop_restaurant_address", "hk_fusion", "the_slug_and_lettuce_address", "little_seoul_address", "michaelhouse_cafe_post_code", "cotto_phone", "taj_tandoori_address", "little_seouls", "golden_wok_post_code", "don_pasquale_pizzeria_phone", "golden_wok_phone", "the_golden_curry", "wagamama_phone", "sitar_tandoori_post_code", "sala_thong_post_code", "dojo_noodle_bar_post_code", "R_cuisine", "mahal_of_cambridge", "cote_phone", "de_luca_cucina_and_bar_post_code", "charlie_chan", "6", "the_good_luck_chinese_food_takeaway_address", "the_nirala_post_code", "golden_house_post_code", "little_seoul_phone", "10", "the_gandhi_post_code", "grafton_hotel_restaurant_address", "saigon_city", "panahar_phone", "nandos_city_centre_phone", "saigon_city_post_code", "thanh_binh_address", "gourmet_burger_kitchen_post_code", "323737", "the_copper_kettle", "rajmahal_address", "thanh_binh_post_code", "india_house_address", "<PAD>", "ugly_duckling_address", "mahal_of_cambridge_address", "rice_house", "pizza_hut_city_centre_phone", "hakka_post_code", "golden_woks", "restaurant_two_two_post_code", "ugly_duckling_post_code", "ask_phone", "ali_baba", "saffron_brasserie_post_code", "pizza_hut_fen_ditton", "jinling_noodle_bar", "curry_prince_address", "2", "sesame_restaurant_and_bar", "la_tasca", "pizza_hut_cherry_hinton_post_code", "meze_bar_restaurant_phone", "meghna_post_code", "pizza_hut_city_centre", "gourmet_burger_kitchen_address", "<SILENCE>", "lan_hong_house", "pizza_hut_cherry_hinton_phone", "the_varsity_restaurant_post_code", "bangkok_city_post_code", "royal_spice_phone", "ali_baba_phone", "pipasha_restaurant_address", "northern_european", "hakka_address", "restaurant_alimentum", "taj_tandoori_phone", "the_nirala", "efes_restaurant_phone", "rice_house_post_code", "efes_restaurant_address", "the_americas", "travellers_rest_post_code", "graffiti_address", "india_house_post_code", "pizza_express_Fen_Ditton_address", "caffe_uno", "loch_fyne", "midsummer_house_restaurant", "chiquito_restaurant_bar", "pizza_express_post_code", "meghna_address", "the_oak_bistro_address", "curry_queen_address", "the_gardenia_post_code", "bedouin_phone", "nandos_post_code", "chiquito_restaurant_bar_post_code", "venue_post_code", "galleria_address", "tandoori_palace", "riverside_brasserie_address", "midsummer_house_restaurant_phone", "the_missing_sock", "bedouin_address", "efes_restaurant", "wagamama_post_code", "caffe_uno_post_code", "meze_bar_restaurant_post_code", "royal_standard_post_code", "bangkok_city", "ugly_duckling", "curry_prince_post_code", "graffiti_phone", "4", "sala_thong", "chiquito_restaurant_bar_address", "j_restaurant", "chiquito_restaurant_bar_phone", "meze_bar_restaurant", "riverside_brasserie", "cocum_post_code", "bloomsbury_restaurant_post_code", "the_lucky_star_phone", "lan_hong_house_address", "jinling_noodle_bar_phone", "curry_queen", "sesame_restaurant_and_bar_address", "restaurant_alimentum_address", "<EOS>", "dojo_noodle_bar", "the_golden_curry_post_code", "de_luca_cucina_and_bar", "5", "hotel_du_vin_and_bistro_post_code", "loch_fyne_post_code", "pizza_hutt", "shiraz_restaurant_post_code", "maharajah_tandoori_restaurant_address", "la_tasca_phone", "curry_king", "rice_house_address", "city_stop_restaurant_phone", "the_cambridge_chop_house_address", "taj_tandoori_post_code", "royal_standard_phone", "nandos_city_centre_post_code", "saint_johns_chop_house_phone", "la_mimosa_phone", "zizzi_cambridge_address", "restaurant_one_seven_phone", "cotto_post_code", "rice_boat_post_code", "shanghai_family_restaurant_phone", "cambridge_lodge_restaurant_address", "the_lucky_star", "la_raza", "curry_king_address", "rice_boat_phone", "travellers_rest_phone", "nandos_address", "riverside_brasserie_post_code", "fitzbillies_restaurant_address", "pizza_hut", "pizza_hut_cherry_hinton", "mahal_of_cambridge_phone", "graffiti_post_code", "backstreet_bistro_phone", "the_hotpot_phone", "hotel_du_vin_and_bistro_phone", "background_speech", "darrys_cookhouse_and_wine_shop_post_code", "bangkok_city_phone", "the_missing_sock_post_code", "la_raza_phone", "golden_wok", "royal_standard", "stazione_restaurant_and_coffee_bar_post_code", "bloomsbury_restaurant_phone", "city_stop_restaurant_post_code", "grafton_hotel_restaurant_phone", "la_mimosa", "the_slug_and_lettuce_post_code", "bangkok_city_address", "golden_house", "yippee_noodle_bar_phone", "india_house_phone", "the_slug_and_lettuce_phone", "hotel_du_vin_and_bistro", "stazione_restaurant_and_coffee_bar", "kymmoy_address", "hotel_du_vin_and_bistro_address", "the_cambridge_chop_house", "anatolia_post_code", "lan_hong_house_post_code", "golden_house_address", "clowns_cafe_address", "cote_address", "da_vinci_pizzeria", "royal_spice", "curry_garden_phone", "fitzbillies_restaurant", "clowns_cafe_phone", "the_nirala_phone", "anatolia_phone", "charlie_chan_phone", "api_call", "the_gandhi_phone", "loch_fyne_phone", "kohinoor_post_code", "kymmoy_phone", "hk_fusion_address", "pizza_hut_city_centre_address", "meze_bar_restaurant_address", "galleria_phone", "rice_boat", "saffron_brasserie", "529", "rajmahal_post_code", "ali_baba_post_code", "frankie_and_bennys_address", "hk_fusion_phone", "pizza_hut_fen_ditton_phone", "saint_johns_chop_house_address", "yu_garden_post_code", "midsummer_house_restaurant_post_code", "the_slug_and_lettuce", "the_river_bar_steakhouse_and_grill_post_code", "saint_johns_chop_house", "ugly_duckling_phone", "galleria_post_code", "prezzo_post_code", "michaelhouse_cafe_address", "curry_prince", "the_cow_pizza_kitchen_and_bar_phone", "charlie_chan_address", "jinling_noodle_bar_post_code", "little_seoul", "rajmahal_phone", "yippee_noodle_bar_post_code", "pipasha_restaurant", "restaurant_two_two", "eraina_post_code", "charlie_chan_post_code", "bloomsbury_restaurant_address", "shiraz_restaurant_phone", "sitar_tandoori", "caffe_uno_address", "cocum_address", "bedouin_post_code", "don_pasquale_pizzeria", "hk_fusion_post_code", "darrys_cookhouse_and_wine_shop_phone", "caffe_uno_phone", "rice_house_phone", "curry_garden_post_code", "peking_restaurant", "the_copper_kettle_phone", "pizza_hut_cherry_hinton_address", "peking_restaurant_address", "panahar_post_code", "la_tasca_address", "restaurant_two_two_address", "saigon_city_phone", "anatolia_address", "efes_restaurant_post_code", "gourmet_burger_kitchen", "cotto_address", "yu_garden", "the_good_luck_chinese_food_takeaway_post_code", "taj_tandoori", "the_varsity_restaurant_phone", "the_gandhi", "backstreet_bistro", "loch_fyne_address", "fitzbillies_restaurant_post_code", "the_golden_curry_address", "eraina_address", "8", "sitar_tandoori_phone", "michaelhouse_cafe", "kohinoor_address", "sala_thong_address", "restaurant_two_two_phone", "restaurant_one_seven", "la_raza_address", "curry_garden_address", "prezzo_address", "the_varsity_restaurant", "la_margherita_post_code", "fitzbillies_restaurant_phone", "venue_phone", "<GO>", "the_hotpot_address", "the_missing_sock_address", "jinling_noodle_bar_address", "the_hotpot", "backstreet_bistro_post_code", "the_missing_sock_phone", "peking_restaurant_post_code", "bloomsbury_restaurant", "grafton_hotel_restaurant", "meghna_phone", "the_copper_kettle_post_code", "frankie_and_bennys_post_code", "royal_spice_post_code", "nandos_city_centre", "the_cambridge_chop_house_post_code", "rice_boat_address", "the_cow_pizza_kitchen_and_bar_address", "shanghai_family_restaurant_address", "pizza_hut_fen_ditton_post_code", "la_mimosa_post_code", "the_oak_bistro_phone", "pipasha_restaurant_post_code", "wagamama_address", "travellers_rest", "cambridge_lodge_restaurant_phone", "restaurant_one_seven_post_code", "restaurant_alimentum_phone", "la_tasca_post_code", "the_cambridge_chop_house_phone", "yu_garden_address", "grafton_hotel_restaurant_post_code", "don_pasquale_pizzeria_post_code", "the_gardenia_address", "the_gardenia", "zizzi_cambridge", "17", "backstreet_bistro_address", "j_restaurant_address", "da_vinci_pizzeria_address", "hakka_phone", "maharajah_tandoori_restaurant_phone", "pizza_express_address", "peking_restaurant_phone", "middle_eastern", "golden_wok_address", "the_hotpot_post_code", "curry_queen_post_code", "maharajah_tandoori_restaurant_post_code", "cambridge_lodge_restaurant", "yippee_noodle_bar", "the_river_bar_steakhouse_and_grill_address", "R_post_code", "stazione_restaurant_and_coffee_bar_address", "shanghai_family_restaurant_post_code", "la_mimosa_address", "3", "yippee_noodle_bar_address", "the_varsity_restaurant_address", "thanh_binh", "shanghai_family_restaurant", "cote_post_code", "7", "the_gardenia_phone", "michaelhouse_cafe_phone", "curry_garden", "mahal_of_cambridge_post_code", "the_golden_curry_phone", "la_margherita_phone", "zizzi_cambridge_post_code", "the_cow_pizza_kitchen_and_bar_post_code", "curry_king_post_code", "the_lucky_star_address", "la_margherita", "saffron_brasserie_phone", "dojo_noodle_bar_address", "1", "de_luca_cucina_and_bar_address", "restaurant_one_seven_address", "nandos_phone", "j_restaurant_post_code", "saint_johns_chop_house_post_code", "the_oak_bistro", "pipasha_restaurant_phone", "lan_hong_house_phone", "R_location", "R_price", "midsummer_house_restaurant_address", "eraina_phone", "pizza_hut_city_centre_post_code", "tandoori_palace_address", "zizzi_cambridge_phone", "kohinoor_phone", "de_luca_cucina_and_bar_phone", "ask_address", "ask_post_code", "riverside_brasserie_phone", "da_vinci_pizzeria_phone", "the_lucky_star_post_code", "da_vinci_pizzeria_post_code", "clowns_cafe_post_code", "clowns_cafe", "tandoori_palace_phone", "cocum_phone", "the_good_luck_chinese_food_takeaway_phone", "gourmet_burger_kitchen_phone", "yu_garden_phone", "frankie_and_bennys", "frankie_and_bennys_phone", "stazione_restaurant_and_coffee_bar_phone", "the_nirala_address", "india_house", "shiraz_restaurant_address", "royal_standard_address", "little_seoul_post_code", "the_gandhi_address", "la_margheritas", "panahar_address", "golden_house_phone", "curry_queen_phone", "0", "kymmoy_post_code", "tandoori_palace_post_code", "the_copper_kettle_address", "curry_prince_phone", "sala_thong_phone", "pizza_express_phone", "la_raza_post_code", "venue_address", "nandos_city_centre_address", "01223", "don_pasquale_pizzeria_address", "dojo_noodle_bar_phone", "j_restaurant_phone", "darrys_cookhouse_and_wine_shop", "sitar_tandoori_address", "the_oak_bistro_post_code", "ali_baba_address", "saigon_city_address", "pizza_express", "R_phone", "prezzo_phone", "maharajah_tandoori_restaurant", "thanh_binh_phone", "R_address", "saffron_brasserie_address", "travellers_rest_address", "sesame_restaurant_and_bar_post_code", "la_margherita_address", ",", ".", "?", "<beg>", "australia", "austria", "belgium", "cambridge", "dubai", "scandinavia", "vietnam", "", "af", "airatarin", "airitran", "aristrain", "arotrian", "bloomsbury", "ca", "cana", "canap", "canapes", "cancun", "canope", "cata", "catalen", "catalin", "catalonia", "chikkis", "chiquito", "corsica", "croatia", "da", "ditton", "ea", "earatree", "eartrain", "eirtrean", "europ", "europene", "gonville", "killeen", "kitalian", "korea", "labonese", "m", "mia", "milton", "moder", "moroccon", "ne", "o", "opean", "ori", "ostro", "polynesia", "prezzos", "s", "scandin", "ser", "sh", "spani", "t", "talian", "taquita", "tha", "thailand", "tran", "vanessa", "ven", "vinci", "vinesha", "wouth", "ye", "york", "adra", "africa", "caius", "che", "chi", "earetree", "po", "pri", "res", "thr", "ts", "a", "ly", "nu", "ot", "p", "pan", "c", "kor", "signa"]}