{"native_language_vocab": ["N", "konsa", "naam", "mila", "ask", "mile", "jaanna", "karna", "honi", "rane", "karata", "fir", "doondna", "hisse", "vah", "yahan", "apke", "chahta", "khyal", "khayal", "call", "ee", "aayega", "aapane", "lenge", "anatolia", "dhundhana", "dhoondhein", "acha", "aaeeem", "pasand", "hAI", "jiske", "matlab", "jahan", "parosane", "eartree", "han", "kariye", "khair", "samudra", "sakate", "deejiye", "chalega", "mujh", "galat", "karege", "dhundna", "waise", "moorkh", "doondne", "cocum", "chahege", "poori", "barabar", "pahunchata", "chahoonga", "usme", "vishwas", "chaiye", "mere", "tumhara", "purana", "kaafi", "namaste", "milega", "hoga", "apko", "karoonga", "shahr", "kaun", "dekhiye", "parsota", "sakte", "chahata", "vaha", "talash", "maamoolee", "servinging", "dena", ".E", "dhundhna", "mel", "nae", "hasna", "cuisine", "kharab", "milta", "keliye", "deta", "rha", "yeh", "aapne", "prezzo", "bahut", "aisa", "chahiye", "hungerian", "khojana", "thanky", "doond", "rakhte", "sirf", "kaise", "karne", "wey", "priece", "diya", "dukh", "usay", "kaho", "serva", "graffiti", "javab", "eraina", "mujhe", "maine", "dey", "main", "kijiye", "kartaho", "laa", "bechte", "baad", "parakar", "chee", "kaheen", "kyaa", "kis", "vaale", "hon", "paravah", "aap", "abhee", "kyu", "minute", "toh", "chinta", "wagamama", "nahin", "dene", "sath", "unke", "alava", "use", "khya", "dhundhiye", "afgani", "khayaal", "rahen", "southtown", "bech", "agala", "pee", "dila", "hunn", "zaruri", "koyi", "dhoondne", "dhyan", "mein", "unn", "kisi", "aapk", "second", "dekhna", "kahan", "yis", "chaahata", "restaraan", "kitana", "vala", "phark", "dhanywad", "bekaar", "dundh", "le", "alavida", "sahi", "hua", "hoo", "karta", "iss", "kaisi", "jaan", "sasta", "dhoondhe", "resturant", "saktha", "sheher", "dein", "soch", "jise", "humein", "karega", "kripa", "rakhta", "parvah", "pass", "muhjey", "alvida", "kuch", "kinare", "kardo", "dhanyabaad", "restaurat", "accha", "jaanta", "sewdish", "jao", "bahuth", "peeche", "janane", "parosata", "badhiya", "padta", "badiya", "na", "ereetrean", "aab", "hakka", "dhanyavaad", "paravaah", "dekha", "veh", "deh", "vichar", "yahi", "achaa", "kate", "karnewala", "dijeye", "kitna", "oka", "khatam", "achhe", "resataurant", "ni", "bhagwan", "dusra", "idhar", "nahe", "dhanyawaad", "karnewaka", "pahle", "sukriya", "kasia", "kkyaal", "jagah", "maayane", "wahan", "parosate", "agar", "jismeh", "dhoondhna", "jisko", "wale", "dhhondna", "usseko", "kirpa", "karte", "afgan", "key", "farak", "kounse", "koil", "doosra", "bhool", ".P", "our", "dekh", "kymmoy", "udhar", "kaam", "bhot", "chaahoonga-", "itna", "croos", "jo", "bata", "kHANA", "uske", "bhaag", "kehta", "ke", "sAKTA", "mujeh", "raha", "karey", "kapra", "prapth", "voh", "tik", "koee", "woh", "aut", "meri", "seve", "nandos", "aise", "sa", "reataurant", ".B", "dhundo", "mat", "konse", "karnevala", "unmein", "aur", "aakhir", ".serve", "kYA", "dhund", "usko", "koe", "baare", "ka", "hava", "khaane", "sujhav", "suno", "leh", "isey", "baaki", "rahana", "zaroorat", "maiene", "kripaya", "si", "shukriya", "pta", "vo", "karun", "ra", "beech", "chriismas", "de", "pe", "hisso", "retaurant", "karo", "dhoodne", "jankari", "bhar", "panahar", "dhundh", "paas", "muje", "din", "dikaye", "kya", "karoge", "yojana", "wala", "thay", "modern-earopean", "uski", "pa", "kare", "ab", "shehar", "kaisa", "cheejo", "khan", "bhojan", "gaya", "lene", "eaisi", "khasi", "parwah", "rahenge", "kar", "jana", "konsi", "achchha", "bohot", "daam", "aUR", "kane", "kaana", "achee", "bas", "rajmahal", "maaf", "dho", "uska", "hu", "alawa", "usse", "batavo", "dobaara", "ve", "khaana", "waha", "kaunsa", "swagat", "afsos", "dhoondh", "mujhko", "jaante", "achha", "rahi", "dubaara", "batainge", "match", "dhoondoge", "kyaal", "taraf", "vale", "rahey", "agla", "aaya", "sabhi", "moderatley", "parostha", "ha", "dhundho", "chahunga", "mjhe", "mamoolee", "maim", "carribbean", "kahin", "kartey", "dhanyawad", "iska", "jiski", "mai", "dhoondna", "paainge", "khoj", "per", "ley", "phhone", "chhoro", "naye", "lag", "rahega", "kam", "krpaya", "kahiye", "khed", "nahi", "abhi", "kiss", "bhi", "dete", "kshetr", "moderatately", "koye", "nishchit", "baarey", "bhee", "mey", "hota", "dhoond", "ek", "tak", "meghna", "wlesh", "hain", "jiska", "boliye", "keemat", "dohra", "galleria", "parwa", "hunjo", "U", "bataye", "server", "baat", "mera", "thaak", "uss", "humare", "mehrbani", "shaher", "khane", "hum", "hoon", "ise", "karathe", "chal", "parosne", "hissa", "doondo", "sun", "kaha", "hona", "rakh", "karnwala", "bus", "suvidha", "nambar", "mujko", "resaturant", "jarurat", "doosre", "cote", "tumhe", "kohinoor", "shuru", "chalo", "unki", "chaahie", "aisi", "liye", "theek", "padata", "band", "sab", "dono", "dhoosara", "ertrean", "rahan", "nunber", ".F", "khoju", "aapka", "dhoondo", "skta", "muhje", "kendriya", "koshish", "saath", "rak", "pareshaan", "milenge", "pas", "sakthe", "shubh", "rukiye", "bahot", "kripya", "jaha", "kata", "ho", "seva", "mil", "aapko", "moderaely", "badal", "karti", "un", "koi", "mujey", "kiske", "haan", "ur", "nhi", "aapki", "janana", "keemath", "caribbiean", "interest", "vahaan", "doosare", "singaporian", "thujko", "iske", "bol", "vaapis", "karane", "tumhare", "jarur", "dhoondhen", "wla", "jab", "khojna", "se", "yah", "kahi", "hein", "koj", "issi", "wah", "tumko", "thik", "waale", "dusura", "janna", "jisme", "sakta", "pata", "jayega", "bhagwaan", "svaagat", "sakata", "pkay", "hamesha", "joh", "ki", "vaala", "ak", "talaash", "hun", "corisca", "batayen", "iski", "taraha", "that's", "kuchh", "kaunse", "does't", "rakhti", "zarurat", "leta", "bare", "rukho", "vali", "bataaya", "kee", "sell", "parvaah", "canonese", "naya", "dek", "mulya", "karoo", "baj", "chaahonga", "saans", "lena", "achi", "denevali", "dijiya", "kisibhi", "dikhata", "meh", "kon", "iy", "unka", "bilkul", "vichaar", "bich", "vahan", "karunga", "venue", "thi", "chahie", "lie", "dusre", "dubara", "parosati", "khyaal", "kisee", "pehla", "cotto", "hoom", "kasie", "muft", "chaahoonga", "dijiye", "bahar", "krpiya", "dhoodna", "endoesian", "yaha", "haa", "vaalee", "prakar", "karnewale", "restauant", "dhanyavad", "nai", "heh", "jamaane", "jananachahata", "lagta", "anusar", "nagar", "bath", "jaye", "karenge", "batao", "dhoondhana", "mI", "aapke", "milegi", "ekdum", "har", "achcha", "kuchbe", "anurodh", "log", "aah", "masala", "rahe", "rehna", "mujhey", "isase", "chahenge", "zara", "bataiye", "samay", "saas", "hai", "corsia", "usey", "dekhte", "yehan", "parva", "phir", "madhyam", "kanrewala", "khaa", "fark", "kaunsi", "bedouin", "tarah", "khana", "achhi", "tum", "pahela", "alag", "aapake", "chahte", "wo", "mUJHE", "mooly", "dhayan", "khojne", "angrezi", "aavashyakata", "saktey", "jante", "apne", "teek", "inka", "dhoondiye", "madad", "lekin", "sake", "chaahenge", "alwida", "shahar", "rahegi", "lo"], "others_vocab": ["hakka_address", "riverside_brasserie_address", "clowns_cafe", "don_pasquale_pizzeria_phone", "city_stop_restaurant_phone", "curry_garden_post_code", "grafton_hotel_restaurant_address", "da_vinci_pizzeria", "thanh_binh_address", "wagamama_address", "bangkok_city_post_code", ",centre", "meze_bar_restaurant_phone", "curry_king", "rice_house", "thanh_binh_post_code", "yu_garden_post_code", "stazione_restaurant_and_coffee_bar_phone", "stazione_restaurant_and_coffee_bar_address", "pizza_hut_fen_ditton_phone", "Patta_and", "the_golden_curry_post_code", "rajmahal_post_code", "sesame_restaurant_and_bar_phone", "shiraz_restaurant_post_code", "the_oak_bistro", "cote_post_code", "curry_queen_post_code", "R_address", "la_tasca", "de_luca_cucina_and_bar", "the_cambridge_chop_house_address", "10", "the_varsity_restaurant_address", "india_house", "3", "cocum_phone", "middle_eastern", "pizza_hut_city_centre", "restaurant_alimentum_phone", "caffe_uno", "travellers_rest_address", "the_varsity_restaurant_phone", "fitzbillies_restaurant_phone", "jinling_noodle_bar_address", "restaurant_alimentum_post_code", "tandoori_palace", "loch_fyne", "backstreet_bistro_address", "efes_restaurant_post_code", "rajmahal_address", "pizza_hut_fen_ditton", "graffiti_address", "cote_address", "5", "the_river_bar_steakhouse_and_grill_post_code", "grafton_hotel_restaurant_post_code", "R_location", "9", "chiquito_restaurant_bar_post_code", "frankie_and_bennys_phone", "<GO>", "curry_king_phone", "shiraz_restaurant_phone", "the_lucky_star_post_code", "midsummer_house_restaurant_address", "grafton_hotel_restaurant_phone", "kymmoy_post_code", "17", "darrys_cookhouse_and_wine_shop", "0", "venue_post_code", "sesame_restaurant_and_bar", "lan_hong_house", "restaurant_one_seven", "bloomsbury_restaurant_phone", "yippee_noodle_bar_address", "hk_fusion_address", "yippee_noodle_bar_phone", "R_cuisine", "darrys_cookhouse_and_wine_shop_phone", "michaelhouse_cafe", "pizza_hutt", "api_call", "kohinoor_post_code", "little_seoul_address", "the_copper_kettle_post_code", "golden_wok", "the_river_bar_steakhouse_and_grill_address", "golden_wok_post_code", "curry_queen_phone", ",kya", "hakka_phone", "taj_tandoori_phone", "kohinoor_phone", "hotel_du_vin_and_bistro_address", "dojo_noodle_bar", "curry_king_address", "pizza_hut_city_centre_phone", "rajmahal_phone", "restaurant_two_two", "michaelhouse_cafe_post_code", "cotto_address", "kohinoor_address", "little_seoul", "pizza_express_phone", "golden_house", "1", "riverside_brasserie_phone", "the_hotpot_address", "venue_address", "cocum_address", "pizza_hut_cherry_hinton_address", "caffe_uno_phone", "saigon_city", "thanh_binh", "efes_restaurant", "frankie_and_bennys_address", "la_tasca_address", "529", "lan_hong_house_phone", "gourmet_burger_kitchen_address", "rice_house_address", "taj_tandoori_post_code", "frankie_and_bennys", "ugly_duckling", "city_stop_restaurant", "sala_thong_post_code", "tandoori_palace_post_code", "backstreet_bistro_phone", "india_house_phone", "R_rating", "bloomsbury_restaurant_address", "shiraz_restaurant", "the_slug_and_lettuce_post_code", "4", "the_hotpot", "the_missing_sock_address", "riverside_brasserie", "la_mimosa", "hk_fusion", "prezzo_address", "nandos_city_centre_address", "la_raza", "saigon_city_post_code", "zizzi_cambridge_post_code", "royal_standard_address", "little_seoul_phone", "bangkok_city_phone", "cocum_post_code", "northern_european", "saint_johns_chop_house_address", "prezzo_post_code", "pizza_hut_fen_ditton_address", "cotto_phone", "graffiti_phone", "sitar_tandoori", "meze_bar_restaurant", "saint_johns_chop_house", "shiraz_restaurant_address", "the_missing_sock_post_code", "pizza_hut_city_centre_post_code", "da_vinci_pizzeria_phone", "pizza_hut_cherry_hinton_phone", "la_margherita_post_code", "rice_boat_address", "6", "the_good_luck_chinese_food_takeaway_phone", "nandos_city_centre_phone", "bedouin_address", "<EOS>", "rice_boat_post_code", "the_slug_and_lettuce", "curry_garden_phone", "clowns_cafe_post_code", "cambridge_lodge_restaurant_address", "travellers_rest_post_code", "city_stop_restaurant_address", "darrys_cookhouse_and_wine_shop_address", "pizza_express", "panahar_post_code", "pizza_express_address", "royal_spice_address", "curry_queen", "travellers_rest_phone", "pizza_hut_cherry_hinton", "golden_wok_phone", "gourmet_burger_kitchen_phone", "taj_tandoori_address", "the_gardenia_post_code", "meghna_address", "the_copper_kettle_phone", "yu_garden_phone", "the_lucky_star", "ali_baba_address", "little_seouls", "dojo_noodle_bar_post_code", "yippee_noodle_bar", "saffron_brasserie_phone", "meze_bar_restaurant_post_code", "michaelhouse_cafe_phone", "la_mimosa_phone", "la_margheritas", "curry_prince_address", "8", "dojo_noodle_bar_phone", "graffiti_post_code", "jinling_noodle_bar_phone", "nandos_phone", "taj_tandoori", "sitar_tandoori_phone", "R_price", "the_gandhi_phone", "royal_standard", "sala_thong", "prezzo_phone", "de_luca_cucina_and_bar_address", "pizza_hut_city_centre_address", "wagamama_phone", "maharajah_tandoori_restaurant_post_code", "yu_garden", "da_vinci_pizzeria_address", "the_hotpot_post_code", "saigon_city_phone", "background_speech", "efes_restaurant_phone", "the_gandhi_address", ",expensive", "bangkok_city", "don_pasquale_pizzeria_post_code", "the_golden_curry", "royal_standard_post_code", "pizza_hut_cherry_hinton_post_code", "cote_phone", "midsummer_house_restaurant", "restaurant_two_two_phone", "the_golden_curry_phone", "la_tasca_post_code", "mahal_of_cambridge_address", "peking_restaurant_address", "fitzbillies_restaurant_address", "peking_restaurant_post_code", "mahal_of_cambridge", "the_copper_kettle", "la_margherita_phone", "sala_thong_address", "peking_restaurant_phone", "pizza_express_Fen_Ditton_address", "the_americas", "the_slug_and_lettuce_address", "city_stop_restaurant_post_code", "the_varsity_restaurant_post_code", "rice_boat_phone", "tandoori_palace_address", "backstreet_bistro_post_code", "anatolia_address", "restaurant_one_seven_address", "the_oak_bistro_address", "panahar_phone", "curry_garden", ",shahar", "ask_phone", "restaurant_two_two_address", "cambridge_lodge_restaurant_phone", "fitzbillies_restaurant_post_code", "fitzbillies_restaurant", "galleria_phone", "the_golden_curry_address", "shanghai_family_restaurant_address", "the_missing_sock_phone", "nandos_city_centre", "gourmet_burger_kitchen", "jinling_noodle_bar_post_code", "eraina_address", "2", "midsummer_house_restaurant_phone", "pizza_hut", "the_cambridge_chop_house_post_code", "saffron_brasserie_post_code", "india_house_address", "hotel_du_vin_and_bistro_post_code", "restaurant_alimentum", "modren_european", "restaurant_one_seven_post_code", "mahal_of_cambridge_post_code", "pipasha_restaurant_phone", "eraina_phone", "golden_wok_address", "stazione_restaurant_and_coffee_bar", "pipasha_restaurant_address", "lan_hong_house_address", "chiquito_restaurant_bar", "<PAD>", "7", "j_restaurant_phone", "the_good_luck_chinese_food_takeaway_address", "hotel_du_vin_and_bistro", "shanghai_family_restaurant", "loch_fyne_post_code", "la_mimosa_post_code", "nandos_address", ",west", "ugly_duckling_address", "thanh_binh_phone", "meghna_phone", "eraina_post_code", "da_vinci_pizzeria_post_code", "<SILENCE>", "india_house_post_code", "the_lucky_star_phone", "saffron_brasserie_address", "pipasha_restaurant", "the_river_bar_steakhouse_and_grill_phone", "saigon_city_address", "golden_house_post_code", "galleria_post_code", "rice_house_phone", "golden_woks", "bedouin_post_code", ",but", "royal_standard_phone", "royal_spice", "yu_garden_address", "bloomsbury_restaurant", "michaelhouse_cafe_address", "darrys_cookhouse_and_wine_shop_post_code", "ask_post_code", "j_restaurant_address", "saffron_brasserie", "01223", "la_tasca_phone", "rice_house_post_code", "la_raza_phone", "ali_baba", "j_restaurant_post_code", "zizzi_cambridge_phone", "sala_thong_phone", "the_gardenia", "panahar_address", "tandoori_palace_phone", "saint_johns_chop_house_phone", "the_slug_and_lettuce_phone", "curry_prince_post_code", "the_nirala_post_code", "cambridge_lodge_restaurant", "the_nirala", "the_cambridge_chop_house_phone", "pipasha_restaurant_post_code", "meghna_post_code", "hotel_du_vin_and_bistro_phone", "caffe_uno_address", "riverside_brasserie_post_code", "maharajah_tandoori_restaurant_address", "zizzi_cambridge", "curry_king_post_code", "curry_queen_address", "the_nirala_address", "bedouin_phone", "the_lucky_star_address", "sesame_restaurant_and_bar_post_code", "the_nirala_phone", "lan_hong_house_post_code", "R_post_code", "charlie_chan_address", "curry_prince", "de_luca_cucina_and_bar_post_code", "meze_bar_restaurant_address", "ali_baba_post_code", "the_cambridge_chop_house", "la_raza_post_code", "don_pasquale_pizzeria_address", "the_good_luck_chinese_food_takeaway", "ali_baba_phone", "gourmet_burger_kitchen_post_code", "ugly_duckling_post_code", "galleria_address", "stazione_restaurant_and_coffee_bar_post_code", "the_oak_bistro_phone", "the_gandhi_post_code", "the_good_luck_chinese_food_takeaway_post_code", "efes_restaurant_address", "chiquito_restaurant_bar_phone", "anatolia_phone", "royal_spice_phone", "golden_house_address", "travellers_rest", "cambridge_lodge_restaurant_post_code", "bangkok_city_address", "wagamama_post_code", "chiquito_restaurant_bar_address", "the_cow_pizza_kitchen_and_bar_post_code", "clowns_cafe_phone", "the_varsity_restaurant", "little_seoul_post_code", "restaurant_alimentum_address", "hk_fusion_post_code", "caffe_uno_post_code", "kymmoy_address", "curry_prince_phone", "mahal_of_cambridge_phone", "the_hotpot_phone", "bloomsbury_restaurant_post_code", "shanghai_family_restaurant_phone", "jinling_noodle_bar", "anatolia_post_code", "ask_address", "the_cow_pizza_kitchen_and_bar_phone", "curry_garden_address", "restaurant_one_seven_phone", "sitar_tandoori_post_code", "maharajah_tandoori_restaurant", "dojo_noodle_bar_address", "saint_johns_chop_house_post_code", "restaurant_two_two_post_code", "midsummer_house_restaurant_post_code", "maharajah_tandoori_restaurant_phone", "the_oak_bistro_post_code", "shanghai_family_restaurant_post_code", "la_raza_address", "yippee_noodle_bar_post_code", "rice_boat", "R_phone", "the_gandhi", "venue_phone", "323737", "charlie_chan_post_code", "zizzi_cambridge_address", "golden_house_phone", "la_mimosa_address", "sitar_tandoori_address", "the_cow_pizza_kitchen_and_bar_address", "ugly_duckling_phone", "frankie_and_bennys_post_code", "j_restaurant", "nandos_post_code", "nandos_city_centre_post_code", "loch_fyne_address", "the_copper_kettle_address", "backstreet_bistro", "grafton_hotel_restaurant", "la_margherita", "peking_restaurant", "loch_fyne_phone", "la_margherita_address", "pizza_hut_fen_ditton_post_code", "the_gardenia_phone", "charlie_chan", "de_luca_cucina_and_bar_phone", "don_pasquale_pizzeria", "hakka_post_code", "royal_spice_post_code", "cotto_post_code", "sesame_restaurant_and_bar_address", "clowns_cafe_address", "kymmoy_phone", "the_missing_sock", "pizza_express_post_code", "hk_fusion_phone", "the_gardenia_address", "108", "charlie_chan_phone", ",", ".", "?", "<beg>", "australia", "austria", "belgium", "cambridge", "dubai", "scandinavia", "vietnam", "", "af", "airatarin", "airitran", "aristrain", "arotrian", "bloomsbury", "ca", "cana", "canap", "canapes", "cancun", "canope", "cata", "catalen", "catalin", "catalonia", "chikkis", "chiquito", "co", "corsica", "croatia", "da", "ditton", "ea", "earatrain", "earatree", "eartrain", "eirtrean", "europ", "europene", "europone", "fre", "gonville", "k", "killeen", "kitalian", "korea", "labonese", "m", "medetanian", "mia", "milton", "moder", "moroccon", "ne", "o", "opean", "ori", "ostro", "par", "ph", "polynesia", "prezzos", "s", "scandin", "ser", "sh", "spani", "t", "talian", "taquita", "tha", "thailand", "tran", "vanessa", "ven", "vinci", "vinesha", "wouth", "ye", "york", "caius", "C", "D", "I", "L", "a", "pan"], "english_language_vocab": ["austral", "all", "ring", "no", "uh", "i'm", "lebanese", "bat", "alternative", "over", "pricerange", "euro", "venison", "north_american", "rest", "suggestion", "usually", "try", "with", "perfect", "darling", "art", "static", "pollynasian", "swedish", "bask", "list", "blow", "what", "request", "river", "american", "crossover", "middle", "confirm", "town", "peace", "meditteranian", "mediteranean", "indian", "serving", "bra", "different", "suggestions", "laugh", "in", "result", "korean", "barbecue", "cow", "brazilian", "holy", "breath", "they", "euorpean", "arts", "polynesian", "mistakes", "ar", "talking", "um", "just", "any", "traditional", "postal", "cough", "jamaican", "welch", "hindi", "indonesian", "other", "laughing", "turk", "food", "yes", "tow", "venetian", "aw", "welsh", "address", "ooh", "gastro", "downtown", "singapore", "gasper", "air", "post", "probably", "feed", "ind", "dish", "price", "romanian", "fine", "class", "like", "viet", "preference", "located", "help", "repeat", "garden", "ecuadorean", "christmas", "right", "hi", "goodbye", "canopus", "central", "inaudible", "one", "time", "spensive", "the", "halo", "takeaway", "sure", "swiss", "is", "re", "bistro", "freakin", "dear", "irish", "kosher", "it", "he", "french", "cross", "bye", "crosstalk", "indo", "care", "to", "priced", "austrian", "code", "huh", "yeah", "port", "german", "vegetarian", "spanish", "world", "asian_oriental", "sea", "catalan", "tasty", "fusion", "derately", "chinese", "very", "south", "salad", "inexpensive", "if", "pick", "hello", "leban", "city", "cannabis", "take", "cool", "australasian", "fen", "aDDRESS", "surprise", "pizza", "new", "ya", "panasian", "we", "malaysian", "out", "music", "portuguese", "afghan", "moderate", "west", "kitchen", "restaurants", "cheap", "sock", "forget", "thanks", "russian", "done", "side", "barbeque", "decide", "phone", "scandinavian", "damn", "nosie", "system", "signature", "part", "area", "last", "matter", "ah", "germ", "college", "hotel", "restaurant", "portugese", "mediterranean", "correct", "me", "offer", "mind", "fast", "road", "ad", "noice", "mmhm", "previews", "cant", "vietnamese", "hungarian", "moderately", "sales", "catalanian", "pub", "indians", "do", "type", "mexican", "halal", "tuscan", "japanese", "caribbean", "austallison", "magdalene", "modern_european", "ger", "awesome", "afternoon", "telephone", "name", "belgian", "regent", "great", "popular", "range", "british", "medium", "cost", "gastropub", "seafood", "available", "are", "basque", "that", "well", "yawning", "postcode", "areas", "selection", "talk", "kay", "nor", "expensive", "wait", "newmarket", "cherries", "hate", "addresses", "pHONE", "asian", "turkey", "us", "street", "mediteranian", "or", "continental", "hm", "train", "ok", "cute", "ko", "be", "appleton", "regular", "much", "okay", "endonesian", "welcome", "jesus", "thai", "european", "austro", "serves", "options", "7:30", "zip", "steakhouse", "singaporean", "east", "of", "north", "inner", "am", "loo", "option", "foo", "place", "burger", "change", "modern", "but", "parts", "house", "unintelligent", "polish", "canape", "cuban", "good", "kind", "please", "number", "you", "find", "african", "persian", "scottish", "steak", "and", "italian", "bar", "umh", "christ", "serve", "wiscon", "reset", "creative", "moroccan", "grill", "recommend", "oriental", "something", "promo", "location", "yea", "ital", "about", "oh", "next", "chesterton", "baskaye", "bart", "again", "australian", "scotch", "baskey", "see", "unintelligible", "knocking", "castro", "luck", "unusual", "cantonese", "eritrean", "sorry", "iam", "center", "centre", "english", "prices", "thank", "by", "missing", "greek", "nUMBER", "park", "water", "choice", "international", "turkish", "danish", "hey", "mail", "dr", "ranges", "tur", "low"]}