{"others_vocab": ["fitzbillies_restaurant_phone", "bloomsbury_restaurant_phone", "city_stop_restaurant_address", "charlie_chan_phone", "cambridge_lodge_restaurant_phone", "chiquito_restaurant_bar_post_code", "3", "yippee_noodle_bar", "rice_house", "the_cow_pizza_kitchen_and_bar_phone", "curry_king_post_code", "pizza_express_address", "eraina_post_code", "jinling_noodle_bar_address", "riverside_brasserie", "midsummer_house_restaurant_address", "royal_standard_address", "the_varsity_restaurant_post_code", "sitar_tandoori_post_code", "the_cambridge_chop_house_phone", "grafton_hotel_restaurant_post_code", "golden_house", "R_rating", "lan_hong_house", "saigon_city", "shiraz_restaurant_address", "the_hotpot_phone", "royal_spice_phone", "the_cow_pizza_kitchen_and_bar_post_code", "midsummer_house_restaurant", "grafton_hotel_restaurant", "La_margheritar", "riverside_brasserie_address", "la_tasca_address", "maharajah_tandoori_restaurant", "hk_fusion_phone", "saigon_city_post_code", "meghna_address", "charlie_chan_post_code", "little_seoul", "the_golden_curry_address", "the_gandhi_post_code", "pipasha_restaurant_post_code", "4", "zizzi_cambridge", "da_vinci_pizzeria", "curry_garden_address", "northern_european", "ugly_duckling_post_code", "cocum_address", "mahal_of_cambridge_phone", "the_varsity_restaurant", "gourmet_burger_kitchen_phone", "frankie_and_bennys_phone", "kohinoor_phone", "bloomsbury_restaurant_post_code", "cote_post_code", "michaelhouse_cafe_phone", "caffe_uno_post_code", "01223", "meghna_post_code", "ugly_duckling", "jinling_noodle_bar_phone", "travellers_rest_post_code", "peking_restaurant_phone", "R_phone", "shanghai_family_restaurant_address", "the_gardenia", "hakka_phone", "the_nirala_phone", "R_location", "R_price", "michaelhouse_cafe_address", "yu_garden", "taj_tandoori", "ali_baba_phone", "efes_restaurant_address", "pizza_express_phone", "the_good_luck_chinese_food_takeaway_phone", "gourmet_burger_kitchen", "frankie_and_bennys", "hk_fusion_post_code", "shanghai_family_restaurant_post_code", "mahal_of_cambridge_post_code", "de_luca_cucina_and_bar_address", "thanh_binh_address", "rajmahal_post_code", "eraina_phone", "api_call", "shiraz_restaurant_post_code", "maharajah_tandoori_restaurant_phone", "maharajah_tandoori_restaurant_address", "peking_restaurant_address", "chiquito_restaurant_bar_address", "ugly_duckling_address", "chiquito_restaurant_bar_phone", "caffe_uno", "riverside_brasserie_phone", "peking_restaurant_post_code", "anatolia_post_code", "the_cambridge_chop_house", "golden_wok_address", "the_slug_and_lettuce_phone", "yippee_noodle_bar_address", "the_river_bar_steakhouse_and_grill_address", "maharajah_tandoori_restaurant_post_code", "la_raza", "la_mimosa_post_code", "midsummer_house_restaurant_phone", "pizza_hut_fen_ditton", "caffe_uno_address", "jinling_noodle_bar_post_code", "shiraz_restaurant_phone", "middle_eastern", "nandos_phone", "darrys_cookhouse_and_wine_shop_phone", "golden_house_phone", "bangkok_city_phone", "lan_hong_house_address", "panahar_phone", "efes_restaurant", "108", "the_golden_curry_post_code", "hakka_address", "india_house_post_code", "little_seoul_post_code", "travellers_rest", "kymmoy_post_code", "2", "meghna_phone", "R_address", "cotto_post_code", "tandoori_palace", "anatolia_phone", "the_cow_pizza_kitchen_and_bar_address", "royal_spice", "9", "taj_tandoori_phone", "darrys_cookhouse_and_wine_shop_address", "shiraz_restaurant", "pizza_hut_city_centre_address", "kohinoor_address", "city_stop_restaurant_post_code", "saint_johns_chop_house_phone", "rajmahal_phone", "the_hotpot", "the_river_bar_steakhouse_and_grill_post_code", "da_vinci_pizzeria_phone", "travellers_rest_phone", "prezzo_address", "sala_thong", "nandos_city_centre_address", "michaelhouse_cafe", "background_speech", "hk_fusion", "gourmet_burger_kitchen_post_code", "stazione_restaurant_and_coffee_bar_post_code", "darrys_cookhouse_and_wine_shop", "the_slug_and_lettuce_post_code", "golden_house_address", "hotel_du_vin_and_bistro_phone", "sitar_tandoori", "the_gandhi", "royal_spice_post_code", "bangkok_city_post_code", "eraina_address", "meze_bar_restaurant_address", "restaurant_alimentum", "yippee_noodle_bar_phone", "pizza_hut", "saigon_city_phone", "pizza_hut_cherry_hinton_phone", "don_pasquale_pizzeria_address", "bedouin_post_code", "ask_address", "clowns_cafe_post_code", "royal_standard", "pizza_hut_cherry_hinton_post_code", "the_gandhi_phone", "cambridge_lodge_restaurant_post_code", "grafton_hotel_restaurant_phone", "the_gardenia_post_code", "fitzbillies_restaurant_address", "pizza_hut_city_centre_post_code", "galleria_post_code", "hk_fusion_address", "bedouin_phone", "rice_boat_address", "peking_restaurant", "zizzi_cambridge_address", "rice_boat_post_code", "frankie_and_bennys_address", "lan_hong_house_post_code", "wagamama_phone", "loch_fyne_post_code", "323737", "restaurant_alimentum_phone", "la_margherita_address", "sitar_tandoori_phone", "restaurant_one_seven", "la_tasca_phone", "<PAD>", "the_nirala_post_code", "cambridge_lodge_restaurant", "the_missing_sock_address", "j_restaurant_post_code", "R_cuisine", "thanh_binh_phone", "rice_house_post_code", "michaelhouse_cafe_post_code", "efes_restaurant_post_code", "mahal_of_cambridge_address", "taj_tandoori_post_code", "restaurant_two_two_phone", "the_good_luck_chinese_food_takeaway_address", "ali_baba_address", "grafton_hotel_restaurant_address", "cotto_address", "pizza_hut_fen_ditton_phone", "cocum_post_code", "rice_boat_phone", "don_pasquale_pizzeria_post_code", "tandoori_palace_post_code", "pipasha_restaurant_address", "curry_garden_post_code", "the_copper_kettle_address", "golden_wok", "0", "the_copper_kettle_post_code", "rajmahal_address", "loch_fyne", "nandos_address", "zizzi_cambridge_post_code", "the_cambridge_chop_house_address", "hotel_du_vin_and_bistro_post_code", "shanghai_family_restaurant", "curry_garden_phone", "loch_fyne_address", "little_seoul_address", "pizza_express_post_code", "restaurant_alimentum_post_code", "india_house_phone", "sesame_restaurant_and_bar_address", "the_oak_bistro", "darrys_cookhouse_and_wine_shop_post_code", "ugly_duckling_phone", "stazione_restaurant_and_coffee_bar", "10", "j_restaurant_address", "the_varsity_restaurant_phone", "restaurant_two_two_address", "shanghai_family_restaurant_phone", "sala_thong_phone", "royal_standard_phone", "backstreet_bistro", "de_luca_cucina_and_bar_phone", "cote_address", "stazione_restaurant_and_coffee_bar_address", "529", "anatolia_address", "tandoori_palace_address", "de_luca_cucina_and_bar_post_code", "the_oak_bistro_phone", "1", "the_lucky_star_address", "yu_garden_post_code", "backstreet_bistro_address", "la_margherita_phone", "venue_post_code", "golden_house_post_code", "saigon_city_address", "curry_queen_phone", "sesame_restaurant_and_bar_phone", "the_varsity_restaurant_address", "fitzbillies_restaurant_post_code", "loch_fyne_phone", "ali_baba_post_code", "yu_garden_phone", "pizza_hut_fen_ditton_post_code", "ali_baba", "restaurant_two_two_post_code", "venue_phone", "zizzi_cambridge_phone", "panahar_address", "dojo_noodle_bar", "curry_prince_address", "nandos_city_centre_phone", "the_lucky_star_post_code", "sesame_restaurant_and_bar_post_code", "cotto_phone", "prezzo_phone", "the_oak_bistro_address", "the_golden_curry_phone", "kohinoor_post_code", "india_house", "rice_house_phone", "saffron_brasserie_address", "8", "da_vinci_pizzeria_post_code", "midsummer_house_restaurant_post_code", "6", "the_hotpot_address", "hakka_post_code", "la_margherita", "chiquito_restaurant_bar", "cote_phone", "bangkok_city", "golden_woks", "clowns_cafe", "dojo_noodle_bar_post_code", "la_tasca", "galleria_phone", "the_missing_sock", "17", "sala_thong_address", "restaurant_one_seven_phone", "sala_thong_post_code", "saint_johns_chop_house", "curry_king_phone", "pizza_express", "the_americas", "graffiti_phone", "dojo_noodle_bar_address", "curry_king_address", "bedouin_address", "caffe_uno_phone", "the_lucky_star_phone", "5", "clowns_cafe_address", "bloomsbury_restaurant_address", "graffiti_post_code", "dojo_noodle_bar_phone", "lan_hong_house_phone", "travellers_rest_address", "the_missing_sock_phone", "curry_garden", "fitzbillies_restaurant", "thanh_binh_post_code", "meze_bar_restaurant_post_code", "bloomsbury_restaurant", "yu_garden_address", "pizza_hutt", "meze_bar_restaurant", "cocum_phone", "don_pasquale_pizzeria_phone", "<EOS>", "taj_tandoori_address", "the_slug_and_lettuce_address", "saffron_brasserie", "mahal_of_cambridge", "cambridge_lodge_restaurant_address", "city_stop_restaurant", "the_gardenia_address", "gourmet_burger_kitchen_address", "the_gandhi_address", "<SILENCE>", "bangkok_city_address", "la_mimosa_address", "venue_address", "curry_queen", "saint_johns_chop_house_address", "pizza_hut_fen_ditton_address", "tandoori_palace_phone", "royal_spice_address", "restaurant_two_two", "the_hotpot_post_code", "the_copper_kettle_phone", "the_nirala", "hotel_du_vin_and_bistro_address", "restaurant_alimentum_address", "sitar_tandoori_address", "graffiti_address", "the_lucky_star", "ask_phone", "don_pasquale_pizzeria", "frankie_and_bennys_post_code", "pizza_hut_cherry_hinton_address", "nandos_city_centre_post_code", "riverside_brasserie_post_code", "meze_bar_restaurant_phone", "golden_wok_post_code", "the_missing_sock_post_code", "la_mimosa", "restaurant_one_seven_address", "kymmoy_phone", "pizza_hut_cherry_hinton", "the_oak_bistro_post_code", "rice_boat", "curry_prince", "j_restaurant", "la_mimosa_phone", "india_house_address", "backstreet_bistro_post_code", "galleria_address", "little_seoul_phone", "da_vinci_pizzeria_address", "7", "stazione_restaurant_and_coffee_bar_phone", "la_raza_post_code", "kymmoy_address", "curry_king", "pizza_hut_city_centre", "sesame_restaurant_and_bar", "efes_restaurant_phone", "the_nirala_address", "rice_house_address", "prezzo_post_code", "saffron_brasserie_phone", "restaurant_one_seven_post_code", "the_river_bar_steakhouse_and_grill_phone", "<GO>", "nandos_post_code", "saint_johns_chop_house_post_code", "curry_prince_phone", "backstreet_bistro_phone", "charlie_chan", "R_post_code", "the_gardenia_phone", "the_cambridge_chop_house_post_code", "clowns_cafe_phone", "pizza_express_Fen_Ditton_address", "royal_standard_post_code", "charlie_chan_address", "pipasha_restaurant", "wagamama_address", "curry_queen_post_code", "hotel_du_vin_and_bistro", "la_margherita_post_code", "saffron_brasserie_post_code", "la_raza_phone", "nandos_city_centre", "the_good_luck_chinese_food_takeaway_post_code", "the_slug_and_lettuce", "la_raza_address", "wagamama_post_code", "de_luca_cucina_and_bar", "the_golden_curry", "curry_queen_address", "pizza_hut_city_centre_phone", "pipasha_restaurant_phone", "thanh_binh", "j_restaurant_phone", "panahar_post_code", "yippee_noodle_bar_post_code", "ask_post_code", "la_tasca_post_code", "the_copper_kettle", "city_stop_restaurant_phone", "jinling_noodle_bar", "curry_prince_post_code", "golden_wok_phone", ",", ".", "?", "<beg>", "australia", "austria", "belgium", "cambridge", "dubai", "scandinavia", "vietnam", "", "airatarin", "airitran", "aristrain", "arotrian", "bloomsbury", "ca", "cana", "canapes", "cancun", "canope", "catalen", "catalin", "catalonia", "chikkis", "chiquito", "corsica", "croatia", "da", "ditton", "earatrain", "earatree", "eartrain", "eirtrean", "europ", "europene", "europone", "fre", "gonville", "killeen", "kitalian", "korea", "labonese", "mia", "milton", "moroccon", "o", "opean", "ori", "ostro", "par", "ph", "polynesia", "s", "scandin", "spani", "t", "talian", "taquita", "thailand", "tran", "vanessa", "vinesha", "york", "adra", "africa", "b", "caius", "che", "chi", "e", "earetree", "er", "po", "pri", "res", "thr", "ts", "C", "D", "L", "a", "pan"], "english_language_vocab": ["magdalene", "takes", "portuguese", "damn", "very", "european", "hindi", "polish", "road", "bistro", "steakhouse", "fusion", "asian", "time", "alternative", "sure", "welcome", "aw", "hi", "number", "thai", "irish", "halo", "modern_european", "river", "system", "hungarian", "code", "static", "crosstalk", "pollynasian", "answer", "re", "bart", "barbecue", "more", "canape", "rest", "bye", "request", "location", "mind", "mmhm", "over", "offer", "i'm", "out", "nice", "sec", "be", "tasty", "regular", "perfect", "okay", "leban", "house", "priced", "venison", "are", "how", "cute", "singaporean", "turkish", "currently", "much", "arts", "ok", "in", "mexican", "area", "pub", "range", "jamaican", "indians", "downtown", "endonesian", "scandinavian", "water", "type", "garden", "wiscon", "information", "continental", "cheap", "catalan", "castro", "part", "thanks", "town", "god", "suggestion", "postcode", "canopus", "middle", "signature", "try", "port", "unusual", "american", "chesterton", "need", "cuban", "viet", "baskaye", "preference", "german", "uh", "polynesian", "christmas", "cow", "euro", "chinese", "dish", "train", "cost", "indonesian", "fucking", "hey", "um", "serve", "cough", "tuscan", "recommend", "side", "restaurants", "bar", "lebanese", "inner", "singapore", "medium", "zip", "centre", "breathing", "my", "cool", "panasian", "welsh", "korean", "central", "options", "selection", "south", "postal", "medterranean", "so", "kitchen", "gastropub", "catalanian", "city", "address", "turk", "cross", "music", "cant", "7:30", "gastro", "north", "fuck", "asian_oriental", "east", "grill", "reset", "hm", "feed", "done", "holy", "brazilian", "meditteranian", "college", "cherries", "indo", "yes", "burger", "care", "venues", "surprise", "basque", "telephone", "salad", "newmarket", "sigh", "pizza", "halal", "huh", "new", "tow", "foo", "goodbye", "romanian", "portugese", "park", "african", "moderately", "swedish", "venetian", "place", "british", "gasper", "signaporian", "ring", "modern", "right", "adress", "moderate", "dear", "hello", "vietnamese", "afghan", "mediteranian", "french", "crossover", "australian", "regent", "change", "or", "europea", "traditional", "center", "ad", "previews", "austral", "malaysian", "promo", "available", "confirm", "i", "breath", "peace", "interested", "creative", "austallison", "minuet", "restaurant", "option", "north_american", "street", "cantonese", "fast", "seafood", "talk", "expensive", "sorry", "euorpean", "jamcian", "kosher", "india", "thank", "it", "danish", "nor", "dress", "freakin", "labenese", "on", "least", "phone", "ah", "confused", "art", "unintelligible", "bat", "fine", "scotch", "japanese", "food", "fen", "scottish", "an", "jesus", "world", ";", "finally", "west", "afternoon", "italian", "hate", "yea", "vegetarian", "the", "sea", "austro", "result", "prices", "steak", "serving", "restuarant", "christ", "ranges", "mediterranean", "missing", "popular", "cannabis", "unintelligent", "darling", "welch", "of", "no", "caribbean", "hold", "bask", "parts", "ecuadorean", "eritrean", "and", "english", "appleton", "austrian", "choice", "ar", "russian", "spanish", "we", "you", "baskey", "belgian", "located", "barbeque", "spensive", "takeaway", "swiss", "mail", "turkey", "repeat", "suggestions", "price", "ooh", "just", "greek", "luck", "persian", "ko", "decide", "australasian", "free", "good", "he", "blow", "but", "indian", "air", "serves", "germ", "last", "knocking", "international", "sock", "list", "moroccan", "im", "post", "hotel", "oriental", "please", "your", "class", "oh", "matter", "than", "mediteranean", "help"], "native_language_vocab": ["shubho", "haan", "khoj", "dekhchhi", "swagoto", "boka", "khali", "hasha", "ha", "chinta", "phelechi", "suru", "soul", "sherokom", "odbhut", "bodoley", "jak", "oishob", "kache", "prothom", "majhklhane", "parcho", "ek", "icchuuk", "bhogoban", "jaani", "restauant", "hashche", "jekhane", "bondho", "konokichu", "chaichilam", "pare", "bikri", "de", "bepare", "hoyte", "jetaserve", "hmm", "otate", "apnake", "darker", "thik", "eita", "charo", "baar", "ache", "ekra", "europeanfusion", "chai", ".F", "ey", "jante", "sosta", "y", "arekta", "jekahne", "besh", "seta", "na", "hoye", "ney", "khujhchi", "dorkar", "heshe", "theke", "kar", "pechone", "sorkar", "koro", "kemon", "jey", "bolle", "thaka", "khojaar", "jodio", "chahi", "kina", "adeo", "ni", "modetately", "jani", "aschi", "aro", "roeche", "parlam", "dao", "kujchi", "jothesto", "nei", "jegulo", "ase", "sell", "cholbe", "ami", "kintu", "daye", "thakbe", "achi", "kothaye", "khete", "beta", "nam", "jekono", "bollo", "khushi", "U", "ekbar", "nijer", "achha", "baaki", "byapar", "ora", "wagamama", "rokom", "koren", "paoa", "motamoti", "jayega", "koreche", "ota", "din", "jaaye", "holo", "ekhoni", "bhalo", "anatolia", "jao", "tale", "too", "jara", "shudhu", "jacche", "kothay", "khabarserve", "jonne", "khobor", "nao", "jaatah", "bollen", "mota", "jakichu", "jeto", "apnar", "jonyo", "amar", "okhaner", "abbout", "otae", "hya", "dam", "server", "oi", "tar", "noy", "oder", "jabe", "khabar", "moti", "bolo", "bas", "chara", "rajmahal", "jaak", "korche", "niye", "lagbe", "apanake", "aey", "kono", "ekhon", ".B", "cheaphungarian", "jeyga", "purono", "apni", "bolun", "ei", "jonnye", "cote", "katuk", "kora", "kichu", "bhabchilam", "hai", "bolche", "pete", "khujchen", "jai", "kon", "sherom", "daaye", "karon", "ashe", "majkhane", "uchit", "korechilam", "majahmajhi", "onyo", "sob", "parbo", "shob", "chaina", "tader", "signal", "shesh", "paro", "dekha", "hobe", "thake", "notun", "etake", "hok", "khaye", "restauranteast", "osob", "eraina", "laglo", "keu", "amake", "korchi", "coda", "dekhchi", "bhule", "tumi", "toh", "chilam", "cheapturkish", "othoba", "dhonnobaad", "baje", "chaichen", "debe", "bedouin", "jar", "jatey", "kotha", "jonno", "venue", "galleria", "hole", "porer", "ekkhuni", "dio", "kachi", "dharan", "okhane", "rakhe", "noise", "masala", "ekdom", "kaaj", "tey", "jayga", "chilo", "cocum", "khojo", "howa", "pawa", "mone", "kirokom", "sheta", "amader", "bolben", "prezzo", "oke", "ashena", "khalar", "achhe", "dutoi", "tomar", "khujte", "otai", "tomake", "dite", "jodi", "nandos", "aore", "ashole", "paren", "abar", "khujchi", "tao", "sathe", "daarun", "nale", "dike", "jayegaye", "botey", "kohinoor", "hote", "diley", "cotto", "jay", "emon", "jaey", "chaijta", "ja", "mondhe", "bhaben", "shaash", "onno", "vincir", "okhankar", "bhabe", "janai", "naam", "meghna", "bhag", "bhabchi", "dhonnobad", "daam", "torche", "graffiti", "noun", "panahar", "parbe", "korune", "ektai", "je", "jinish", "ete", "pashe", "kotota", "jaye", "match", "prezzor", "otar", "chole", "pore", "nie", "gulo", "khojar", "kamon", "geche", "arekbar", "bolchi", "palte", "khub", "bishash", "oita", "onek", "pari", "ekhane", "bolbe", "hakka", "hoa", ".E", "khujtei", "shekhane", "icum", "te", "jeigulo", "jeta", "korbo", "hoe", "khabarovsk", "tulche", "thaktei", ".P", "acha", "majhe", "koto", "pele", "majhari", "kom", "chiquitor", "korte", "khoja", "hochhe", "naki", "thikthak", "konta", "ani", "N", "por", "majhkhane", "alada", "cheye", "hocche", "amay", "sadharonoto", "korar", "moton", "prathom", "erom", "shotti", "ke", "kisher", "korchhe", "lOCATION]", "hyaa", "bole", "little", "aache", "shona", "kymmoy", "jaygah", "darao", "khujle", "jets", "darun", "kori", "r", "thakte", "parben", "jon", "kichhu", "rmodhhe", "etai", "dhanyobad", "tai", "kno", "aar", "cuisine", "jaygar", "ekta", "dekhao", "mean", "ask", "hoya", "jachetai", "shuru", "chaan", "sekhane", "tahole", "pochondo", "jana", "nite", "eta", "uhh", "bhul", "naa", "etotai", "faaltu", "upore", "eikhane", "protyek", "jetake", "dekhay", "dekhecho", "muhurto", "ektu", "call", "elta", "bolte", "tobe", "khuje", "baki", "korbe", "shono", "hoy", "centar", "aaro", "korchen", "kore", "shomporke", "shunte", "proce", "kothao", "shunne", "included", "ki", "ta", "jetate", "etar", "accha", "kete", "korben", "diye", "orom", "chesta", "buddihin", "kacha", "byapare", "shohor", "ager"]}