{"others_vocab": ["curry_queen_address", "ali_baba_post_code", "tandoori_palace", "the_gandhi_phone", "7", "saigon_city_phone", "the_gandhi", "kohinoor_phone", "pizza_hut_fen_ditton_address", "grafton_hotel_restaurant", "royal_spice_phone", "sesame_restaurant_and_bar_post_code", "the_slug_and_lettuce_phone", "michaelhouse_cafe", "sala_thong_phone", "travellers_rest", "the_river_bar_steakhouse_and_grill_phone", "the_gardenia_address", "don_pasquale_pizzeria_phone", "meze_bar_restaurant_address", "the_cow_pizza_kitchen_and_bar_address", "pizza_express_Fen_Ditton_address", "la_tasca_post_code", "curry_king_address", "middle_eastern", "the_missing_sock_post_code", "peking_restaurant_phone", "cambridge_lodge_restaurant_address", "little_seoul_post_code", "taj_tandoori", "restaurant_alimentum", "curry_prince_address", "charlie_chan_post_code", "the_oak_bistro", "pizza_hut", "1", "the_golden_curry_post_code", "pizza_hut_city_centre", "de_luca_cucina_and_bar_address", "don_pasquale_pizzeria_post_code", "grafton_hotel_restaurant_address", "j_restaurant_address", "golden_wok", "anatolia_post_code", "nandos_post_code", "royal_standard_post_code", "saint_johns_chop_house_address", "la_margherita_post_code", "yippee_noodle_bar_phone", "bedouin_post_code", "maharajah_tandoori_restaurant", "pizza_express_post_code", "pizza_hut_fen_ditton", "sesame_restaurant_and_bar_phone", "rice_house_phone", "restaurant_two_two_address", "pizza_hut_cherry_hinton_post_code", "bloomsbury_restaurant_post_code", "the_hotpot_address", "midsummer_house_restaurant_address", "riverside_brasserie_address", "cocum_address", "mahal_of_cambridge_post_code", "peking_restaurant_post_code", "kohinoor_address", "bedouin_address", "loch_fyne_phone", "bangkok_city_post_code", "saigon_city_post_code", "the_lucky_star_address", "323737", "restaurant_one_seven_address", "stazione_restaurant_and_coffee_bar_address", "restaurant_two_two", "the_nirala_address", "pipasha_restaurant", "pizza_express", "mahal_of_cambridge", "hk_fusion_phone", "0", "restaurant_alimentum_address", "curry_king_post_code", "midsummer_house_restaurant_post_code", "india_house_address", "mahal_of_cambridge_phone", "curry_garden", "shiraz_restaurant_post_code", "thanh_binh_address", "city_stop_restaurant_post_code", "venue_phone", "taj_tandoori_phone", "de_luca_cucina_and_bar", "ugly_duckling_phone", "curry_garden_phone", "nandos_city_centre]", "rajmahal_phone", "anatolia_phone", "nandos_city_centre", "curry_king", "the_golden_curry_address", "michaelhouse_cafe_phone", "charlie_chan_address", "chiquito_restaurant_bar_post_code", "moderan_european", "fitzbillies_restaurant_address", "northern_european", "the_missing_sock_address", "efes_restaurant_phone", "venue_post_code", "pizza_express_phone", "Modern_european", "ask_address", "peking_restaurant", "jinling_noodle_bar", "rice_boat", "backstreet_bistro_post_code", "the_copper_kettle_phone", "dojo_noodle_bar_post_code", "fitzbillies_restaurant_phone", "thanh_binh", "lan_hong_house_post_code", "sitar_tandoori", "india_house_post_code", "jinling_noodle_bar_phone", "loch_fyne", "ugly_duckling", "anatolia_address", "sesame_restaurant_and_bar", "clowns_cafe_post_code", "the_gandhi_post_code", "the_nirala", "the_hotpot_phone", "17", "sitar_tandoori_address", "cotto_post_code", "sitar_tandoori_phone", "the_missing_sock_phone", "curry_prince", "da_vinci_pizzeria", "hotel_du_vin_and_bistro_post_code", "pizza_hut_city_centre_post_code", "the_gardenia_phone", "dojo_noodle_bar_address", "caffe_uno_address", "meghna_phone", "zizzi_cambridge_address", "the_cambridge_chop_house_address", "the_gardenia", "zizzi_cambridge_phone", "the_gandhi_address", "ask_phone", "meze_bar_restaurant_phone", "wagamama_post_code", "nandos_city_centre_phone", "curry_garden_post_code", "michaelhouse_cafe_address", "pizza_express_address", "efes_restaurant_address", "golden_woks", "city_stop_restaurant_address", "caffe_uno", "frankie_and_bennys_address", "golden_wok_phone", "zizzi_cambridge", "travellers_rest_address", "shiraz_restaurant", "the_oak_bistro_address", "don_pasquale_pizzeria", "yu_garden_phone", "cotto_address", "little_seouls", "grafton_hotel_restaurant_phone", "cotto_phone", "prezzo_post_code", "the_copper_kettle", "rice_boat_phone", "cote_post_code", "j_restaurant_post_code", "lan_hong_house_phone", "saint_johns_chop_house", "royal_standard_phone", "taj_tandoori_address", "api_call", "10", "restaurant_one_seven", "chiquito_restaurant_bar_address", "chiquito_restaurant_bar_phone", "yippee_noodle_bar", "cambridge_lodge_restaurant_phone", "la_raza", "the_gardenia_post_code", "charlie_chan_phone", "kymmoy_post_code", "frankie_and_bennys_phone", "gourmet_burger_kitchen_address", "frankie_and_bennys", "R_post_code", "tandoori_palace_post_code", "bedouin_phone", "the_good_luck_chinese_food_takeaway_phone", "morden_european", "the_varsity_restaurant_address", "chiquito_restaurant_bar", "la_raza_post_code", "8", "travellers_rest_post_code", "j_restaurant_phone", "the_lucky_star", "the_good_luck_chinese_food_takeaway_address", "hotel_du_vin_and_bistro_address", "528", "wagamama_phone", "wagamama_address", "the_oak_bistro_phone", "thanh_binh_phone", "da_vinci_pizzeria_phone", "golden_house", "jinling_noodle_bar_post_code", "la_raza_phone", "the_cambridge_chop_house", "6", "maharajah_tandoori_restaurant_phone", "the_missing_sock", "pizza_hut_city_centre_address", "ugly_duckling_address", "sala_thong_post_code", "mimosa_post_code", "hk_fusion_post_code", "the_americas", "galleria_address", "ali_baba_address", "gourmet_burger_kitchen_phone", "dojo_noodle_bar", "da_vinci_pizzeria_post_code", "<EOS>", "jinling_noodle_bar_address", "pizza_hut_cherry_hinton", "maharajah_tandoori_restaurant_post_code", "the_varsity_restaurant", "maharajah_tandoori_restaurant_address", "rice_house_post_code", "curry_queen_post_code", "R_rating", "pipasha_restaurant_post_code", "hotel_du_vin_and_bistro_phone", "saffron_brasserie", "lan_hong_house", "peking_restaurant_address", "la_margheritas", "background_speech", "01223", "galleria_post_code", "ali_baba_phone", "la_mimosa", "the_nirala_phone", "royal_standard", "golden_wok_post_code", "ugly_duckling_post_code", "nandos_city_centre_address", "de_luca_cucina_and_bar_phone", "cocum_post_code", "curry_king_phone", "de_luca_cucina_and_bar_post_code", "la_raza_address", "j_restaurant", "pipasha_restaurant_phone", "gourmet_burger_kitchen", "the_hotpot_post_code", "R_address", "efes_restaurant_post_code", "pizza_hut_fen_ditton_post_code", "stazione_restaurant_and_coffee_bar_post_code", "curry_queen", "clowns_cafe_phone", "venue_address", "kymmoy_address", "the_slug_and_lettuce_post_code", "curry_prince_post_code", "pizza_hut_cherry_hinton_address", "backstreet_bistro_phone", "restaurant_two_two_phone", "pizza_hut_cherry_hinton_phone", "prezzo_phone", "golden_house_phone", "nandos_address", "cambridge_lodge_restaurant_post_code", "the_copper_kettle_address", "the_river_bar_steakhouse_and_grill_post_code", "india_house", "the_river_bar_steakhouse_and_grill_address", "royal_spice_address", "eraina_phone", "shanghai_family_restaurant_phone", "saint_johns_chop_house_post_code", "bangkok_city_address", "the_golden_curry", "taj_tandoori_post_code", "cambridge_lodge_restaurant", "the_lucky_star_post_code", "grafton_hotel_restaurant_post_code", "curry_garden_address", "yu_garden_address", "riverside_brasserie_post_code", "2", "shiraz_restaurant_address", "galleria_phone", "michaelhouse_cafe_post_code", "riverside_brasserie", "pizza_hut_fen_ditton_phone", "saint_johns_chops_house_post_code", "eraina_address", "saffron_brasserie_post_code", "R_cuisine", "tandoori_palace_phone", "kymmoy_phone", "meghna_address", "the_nirala_post_code", "golden_wok_address", "little_seoul_phone", "saigon_city", "bangkok_city", "royal_spice_post_code", "don_pasquale_pizzeria_address", "fitzbillies_restaurant_post_code", "golden_house_post_code", "loch_fyne_address", "4", "the_copper_kettle_post_code", "clowns_cafe", "darrys_cookhouse_and_wine_shop", "pizza_hutt", "the_oak_bistro_post_code", "gourmet_burger_kitchen_post_code", "hotel_du_vin_and_bistro", "yippee_noodle_bar_post_code", "the_cambridge_chop_house_post_code", "sala_thong_address", "la_margherita", "backstreet_bistro", "caffe_uno_post_code", "midsummer_house_restaurant_phone", "hk_fusion", "la_tasca", "india_house_phone", "<GO>", "la_mimosa_phone", "the_varsity_restaurant_post_code", "cocum_phone", "nandos_phone", "<SILENCE>", "rajmahal_address", "la_mimosa_post_code", "shanghai_family_restaurant_post_code", "3", "108", "la_margherita_phone", "prezzo_address", "zizzi_cambridge_post_code", "frankie_and_bennys_post_code", "resturant_alimentum_post_code", "shanghai_family_restaurant_address", "yippee_noodle_bar_address", "rice_boat_post_code", "city_stop_restaurant_phone", "loch_fyne_post_code", "shanghai_family_restaurant", "la_mimosa_address", "darrys_cookhouse_and_wine_shop_post_code", "curry_prince_phone", "rajmahal_post_code", "rice_boat_address", "graffiti_phone", "rice_house", "sala_thong", "bloomsbury_restaurant_address", "hakka_phone", "curry_queen_phone", "kohinoor_post_code", "R_phone", "la_", "sitar_tandoori_post_code", "da_vinci_pizzeria_address", "fitzbillies_restaurant", "bloomsbury_restaurant", "the_cambridge_chop_house_phone", "graffiti_post_code", "saffron_brasserie_phone", "pizza_hut_city_centre_phone", "panahar_phone", "cote_address", "hakka_post_code", "the_cow_pizza_kitchen_and_bar_post_code", "la_tasca_address", "golden_house_address", "saigon_city_address", "rice_house_address", "<PAD>", "little_seoul_address", "panahar_address", "restaurant_two_two_post_code", "the_cow_pizza_kitchen_and_bar_phone", ",center", "caffe_uno_phone", "little_seoul", "lan_hong_house_address", "tandoori_palace_address", "9", "pipasha_restaurant_address", "efes_restaurant", "saint_johns_chop_house_phone", "eraina_post_code", "la_margherita_address", "clowns_cafe_address", "shiraz_restaurant_phone", "restaurant_one_seven_post_code", "royal_standard_address", "dojo_noodle_bar_phone", "5", "meze_bar_restaurant", "darrys_cookhouse_and_wine_shop_phone", "graffiti_address", "ali_baba", "la_tasca_phone", "hk_fusion_address", "riverside_brasserie_phone", "the_varsity_restaurant_phone", "restaurant_one_seven_phone", "stazione_restaurant_and_coffee_bar_phone", "the_slug_and_lettuce_address", "travellers_rest_phone", "charlie_chan", "the_golden_curry_phone", "modern_European", "yu_garden_post_code", "midsummer_house_restaurant", "yu_garden", "meghna_post_code", "R_location", "restaurant_alimentum_phone", "cote_phone", "thanh_binh_post_code", "the_good_chinese_food_takeaway_post_code", "city_stop_restaurant", "darrys_cookhouse_and_wine_shop_address", "backstreet_bistro_address", "mahal_of_cambridge_address", "the_hotpot", "stazione_restaurant_and_coffee_bar", "bloomsbury_restaurant_phone", "meze_bar_restaurant_post_code", "ask_post_code", "panahar_post_code", ",haa", "the_lucky_star_phone", "saffron_brasserie_address", "the_slug_and_lettuce", "royal_spice", "R_price", "bangkok_city_phone", "restaurant_alimentum_post_code", "sesame_restaurant_and_bar_address", "hakka_address", ",", ".", "?", "<beg>", "australia", "austria", "belgium", "cambridge", "dubai", "scandinavia", "vietnam", "", "af", "airatarin", "airitran", "aristrain", "arotrian", "bloomsbury", "cana", "canap", "canapes", "cancun", "canope", "cata", "catalen", "catalin", "catalonia", "chikkis", "chiquito", "co", "corsica", "croatia", "da", "ditton", "earatrain", "earatree", "eartrain", "eirtrean", "europ", "europene", "gonville", "k", "killeen", "kitalian", "korea", "labonese", "m", "mia", "milton", "ne", "o", "opean", "ori", "ostro", "par", "polynesia", "prezzos", "s", "ser", "sh", "t", "talian", "taquita", "tha", "thailand", "tran", "vanessa", "ven", "vinci", "vinesha", "wouth", "ye", "york", "adra", "africa", "b", "caius", "che", "chi", "e", "earetree", "er", "pri", "res", "A", "C", "D", "I", "L", "a", "ly", "nu", "ot", "p", "pan", "kor", "signa"], "native_language_vocab": ["kai", "mujab", "swagat", "made", "chhe", "karato", "apo", "phona", "shakvu", "pato", "jaruri", "U", "jagah", "pasand", "valu", "aapti", "babat", "walo", "ae", "khoraka", "ma", "pachu", "bhagwan", "saranamum", "mange", "aima", "junu", "ha", "shaku", "karine", "havey", "keh", "ane", "devun", "aenu", "hovu", "krupa", "emma", "sango", "fikar", "vichari", "apati", "tamme", "singaporian", "mari", "bhagamam", "chali", "restaurnt", "carribean", "rajmahal", "sakto", "interest", "bhejvavun", "naam", "parose", "nagarana", "karum", "namskar", "sudhi", "sodha", "sarvat", "server", "tanu", "jovu", "tyaa", "u", "`", "avy", "thodo", "sereve", "mazama", "mhare", "sasti", "sakum", "maro", "nathi", "banse", "expensiverestaurant", "gamse", "krwa", "hatu", "lau", "koda", "vinanti", "shodhvani", "ketlak", "ghanu", "kimmat", "choye", "batavo", "farithi", "suchano", "melavi", "aatlu", "kono", "adddress", "shakahari", "kevi", "badhu", "khakhadavu", "tamre", "kar", "banne", "vat", "chie", "kaayi", "sodhavani", "nathiphone", "avjo", "mam", "leta", "karto", "khorak", "kimmata", "aavjo", "avashyak", "aptucheap", "samanya", "kahis", "kartuek", "jeni", "shodha", "kalaji", "krso", "para", "mhar", "kasu", "apl", "nahi", "jagya", "service", "su", "chu;", "latkavi", "tiraskar", "cneter", "marr", "vehche", "prakarno", "dosent", "kripa", "karish", "ho", "jevu", "tamaru", "malasian", "parsiyana", "jou", "hathi", "apse", "aisan", "anurup", "shodho", "karilau", "haan", "khavano", ".B", "ich", "scottich", "nave", "tani", "saranamu", "sodhava", "temani", "kidho", "shodhva", "khotu", "pirsai", "boli", "vastuo", "karsho", "bhagama\u1e41", "call", "jyaaare", "koi", "tema", "saher", "madad", "tyaanu", "karavanun", "deva", "tamaro", "avaj", "badhe", "southof", "tenathi", "najik", "aathi", "anr", "thae", "tapasmachun", "nw", "brazillian", "sodhhi", "tari", "mate", "sagwad", "please!", "shodhvama", "vikhyat", "saro", "teoni", "janvu", "puchi", "rakhi", "super", "kahyu", "hata", "chalse", "prakarni", "ainu", "kohinoor", "tene", "amari", "karwa", "prakar", "kahesho", "aemno", "khanu", "tyam", "mahan", "bijikoi", "mago", "barabar", "madhy", "jyam", "naseeb", "bhul", "kimmte", "anatolia", "annmum", "sakso", "kaai", "eyno", "pramane", "jaani", "pahela", "restaruants", "divas", "mach", "foodsouth", "sochvu", "rahyo", "sodho", "tethi", "chhp", "sun", "mare", "ahi", "javu", "tesodho", "chhy", "shake", "mujabni", "madi", "ochha", "taklif", "kayu", "jote", "kehso", "aapsho", "bhav", "chalo", "gaam", "sari", "jumaican", "amnu", "vachhchhe", ".E", "prakarnu", "kona", "parwah", "sakse", "kapo", "bhaag", "ehnu", "sodi", "mahre", "oje", "mafat", "pric", "temni", "prakarna", "duniya", "matalaba", "rakhato", "chu", "fakt", "serveds", "sundar", "rahya", "ichchhu", "vise", "khorakh", "hajar", "hade", "mum", "maaf", "mangu", "keva", "hovi", "pra", "jaroor", "shun", "moerately", "temathi", "dilgir", "arera", "hun", "karse", "cotto", "thodu", "kartu", "restarant", "enu", "sthale", "kii", "oe", "jeva", "also", "badali", "gotu", "pabasian", "rum", "eraina", "paase", "hol", "eno", "huun", "confuse", "sachu", "saou", "tamari", "hovo", "marl", "rahyu", "bhojan", "karcu", "avu", "badlo", "badha", "kem", "karti", "bhag", "tpwn", "aapto", "padharo", "priya", "konathi", "lai", "loko", "number!", "hovum", "tamnu", "ekaj", "gayu", "parosatu", "ejoea", "swas", "kayo", "kalji", "kya", "kato", "kimat", "tupe", "prezzo", "hon", "wal", "pasethi", "arey", "tevu", "tevi", "saachi", "medvi", "sreni", "tpe", "sarnama", "aabhar", "jahirat", "karta", "ke", "bolso", "chum", "tyare", "tamane", "biji", "kiak", "shodhawa", "tamare", "fodo", "chehye", "kayi", "jode", "bijum", "centerof", "thambo", "hakka", "chu!", "joitu", "aapvi", "addeess", "smaye", "restaurantcheap", "joiye", "haso", "vala", "nai", "dvara", "sodhamam", "pirsati", "rahiya", "sakis", "teo", "chhr", "sevan", "bandh", "chho", "gaya", "tyan", "joise", "athva", "baki", "match", "avun", "emno", "ketlu", "kaiya", "waru", "jaga", "tya", "rane", "namaskar", "hova", "mali", "sara", "vadhare", "sucana", ".P", "bane", "aapso", "chhu", "prabha", "karo", "N", "jate", "towm", "aevi", "ketlo", "shako", "ahiya", "sakta", "karu", "jarur", "sambhali", "eva", "vadi", "mathi", "asmanya", "hujoe", "joto", "peli", "fervi", "aaveli", "serv", "nam", "tye", "barobar", "aa", "thayu", "hoe", "sum", "karva", "sar", "joyye", "vaaru", "thatu", "teno", "tamro", "msu", "kaam", "westof", "anya", "farka", "bhagama", "ttamari", "shodhwa", "khana", "maine", "janvi", "jais", "sarnamu", "sambhdi", "pana", "karvama", "kaya", "bedouin", "restauran", "vaar", "jaanvu", "chhelle", "jya", "shodo", "ena", "retaurant", "kahevun", "sreve", "sastu", "prakarama", "pass", "tamharo", "uma", "jai", "pochi", "aap", "zaroori", "nambara", "joye", "kare", "vach", "baju", "n", "kari", "parosi", "mango", "tena", "sakay", "numer", "samaye", "aapo", "jaruriyat", "joa", "kharab", "kymmoy", "alag", "madhya", "joe", "jema", "pos\u1e6dana", "raho", "problem", "sarname", "workin", "kamika", "sthita", "restarurant", "joyiye", "vishay", "na", "dekhado", "baaju", "jav", "khali", "rahyam", "jyan", "koipan", "navai", "cocum", "keu", "thika", "padtu", "khabar", "fark", "shaher", "thoduk", "nandos", "wala", "joje", "fare", "okau", "malshe", "padse", "karso", "sadhara\u1e47a", "apavi", "toh", "kaipan", "pachhi", "eka", "umber", "ask", "parantu", "great!", "konu", "ha!", "kaheso", "cUISINE]", "gametya", "jaav", "haa", "apvi", "el", "joea", "apata", "kashu", "ehno", "seva", "beeju", "vishe", "athwa", "namabara", "restarunt", "gam", "ketluk", "job", "kahe", "pasant", "vachche", "jamvanu", "shu", "hasi", "aabahar", "ichchhta", "gamado", "cote", "punravartan", "ehvu", "aape", "api", "bahu", "maari", "bijo", "tamno", "shukran", "hay", "angrejee", "jalak", "shodhi", "paidi", "prakrar", "saaru", "chaho", "panahar", "karte", "shod", "hum", "joeye", "jara", ".F", "malvi", "ghar", "saranaman", "tamne", "sodhu", "khavanu", "sodhi", "vinantine", "pachha", "mame", "hoye", "pn", "tamni", "meharbani", "maj", "sodhva", "judu", "tenu", "talas", "karyo", "lo", "gamey", "vadhu", "rstaurant", "avi", "aatla", "padto", "vicara", "khock", "naa", "tyano", "sakahari", "vando", "kewa", "sake", "farak", "galleria", "malse", "shodhu", "uparant", "masala", "temna", "teona", "parva", "cheaprestaurant", "amne", "krpa", "bolo", "sodhvu", "saras", "jarurat", "malsu", "game", "rahi", "karvo", "vada", "vividh", "ehni", "mara", "thi", "eloko", "paart", "vichar", "khub", "hase", "pade", "jamvu", "upar", "kamipanna", "maan", "kami", "ama", "wagamama", "temno", "evo", "temnu", "tmara", "kae", "te", "hu", "temana", "rhyo", "temano", "ni", "monghi", "j", "joia", "include", "char", "ape", "madvu", "navu", "reataurant", "vali", "koipa", "sache", "romain", "joie", "maaj", "lage", "aaju", "kehvu", "vechti", "parakar", "kaho", "atyare", "saathe", "kyare", "meherbani", "hoi", "ee", "kashun", "prathama", "rakho", "parosati", "graffiti", "eastside", "joi", "ochhu", "chinata", "jo", "lagse", "biju", "rahyio", "anu", "sharu", "kaik", "maate", "puru", "jov", "karjo", "aayvi", "abhar", "nthi", "akrum", "sivaya", "teyo", "tamna", "taraf", "mandal", "bhavse", "meghna", "shodhvi", "sivay", "mane", "sathenu", "saru", "saksho", "evu", "sodhvani", "bijanu", "sathe", "karnar", "bau", "kharcho", "kitalina", "chhellu", "kiyan", "karis", "jarura", "kyan", "pachi", "pacho", "venue", "chun", "matra", "koipana", "kevu", "bija", "kaek", "korsika", "tradisional", "posta", "male", "babata", "cho", "sakun", "shodi", "apta", "kuvo", "evi", "vistar", "melvi", "biju\u1e41", "aemnu", "bas", "malyum", "jeno", "karvu", "mate`", "pase", "ekdum", "foood", "saku", "parvah", "aj", "sarum", "aana", "jenu", "sadharan", "jawab", "kadach", "temne", "ek", "hati", "pacha", "pela", "sodhvi", "aapta", "resturant", "ko\u1e0da", "kahi", "hato", "gamti", "ka\u1e37aji", "hasvu", "welcone", "shodvama", "vandho", "asamanya", "tame", "aek", "carribbean", "ichchho", "sako", "select", "tamri", "vache", "bhuli", "soghi", "feravyo", "rite", "chinta", "khava", "thata", "cuisine", "aeva", "apti", "addresss", "pelu", "vaat", "mar", ".tamne", "hovun", "ana", "rahyou", "jase", "teonu", "mmber", "lava", "paachu", "morderately", "seve", "hy", "bada", "hub", "V", "tae", "je", "hoy", "nagar", "restoranta", "meharani", "umm", "shdhu", "veche", "tamara", "kharchala", "sodhvanu", "icchu", "agar", "aapi", "rehse", "fari"], "english_language_vocab": ["you", "african", "sea", "help", "alright", "tur", "promo", "traditional", "cannabis", "kitchen", "garden", "the", "hotel", "wiscon", "missing", "moroccan", "brazilian", "asian_oriental", "serve", "moderate", "low", "really", "suggestion", "south", "great", "ecuadorean", "greek", "fusion", "city", "polynesian", "dish", "restaurant", "ring", "just", "river", "no", "over", "newmarket", "fen", "restaurants", "austallison", "7:30", "bistro", "seafood", "surprise", "result", "central", "steakhouse", "hm", "scandinavian", "mediterranean", "east", "pleas", "bye", "french", "caribbean", "okay", "north_american", "creative", "talk", "burger", "medterranean", "type", "port", "part", "first", "zip", "belgian", "options", "addresses", "welsh", "sec", "am", "adress", "swedish", "preference", "correct", "to", "ind", "hello", "barbecue", "what", "eritrean", "cherries", "im", "singaporean", "sorry", "unusual", "noice", "baskey", "leban", "nosie", "christ", "christmas", "cant", "afternoon", "minuet", "pricerange", "one", "cool", "vegetarian", "serving", "need", "modern_european", "sure", "meditteranian", "that", "worthless", "range", "name", "pleasE", "foo", "west", "oh", "mexican", "catalan", "very", "as", "hungarian", "peace", "welch", "sock", "and", "venetian", "baskaye", "postal", "yea", "singapore", "park", "or", "germ", "road", "australasian", "indonesian", "static", "dress", "uh", "sucks", "list", "be", "polish", "it", "cantonese", "request", "sells", "austrian", "cow", "bar", "something", "portugese", "basque", "plea", "irish", "viet", "english", "excellent", "serves", "russian", "castro", "north", "an", "time", "blow", "prices", "cough", "international", "hi", "area", "unintelligent", "fast", "freakin", "talking", "gastropub", "chesterton", "tasty", "out", "euro", "priced", "he", "canopus", "nice", "derately", "god", "crosstalk", "their", "instead", "darling", "venison", "number", "expensive", "breath", "post", "persian", "moderately", "american", "unintelligible", "cute", "austral", "european", "cheap", "codE", "indians", "finished", "halal", "please", "continental", "luck", "hindi", "fine", "fora", "thank", "aw", "oriental", "inner", "fucking", "bat", "phone", "of", "option", "europea", "food", "medium", "kay", "barbeque", "repeat", "labenese", "kind", "modernity", "thai", "recommend", "magdalene", "air", "me", "takeaway", "right", "there", "grill", "malaysian", "ooh", "signature", "indian", "australian", "fuck", "yeah", "about", "information", "jamcian", "center", "turkish", "goodbye", "have", "place", "are", "house", "start", "scottish", "afghan", "ranges", "catalanian", "mediteranean", "side", "care", "huh", "pizza", "yes", "mediteranian", "try", "cost", "swiss", "centre", "much", "jamaica", "system", "nor", "india", "i", "tuscan", "parts", "mmhm", "college", "cuban", "music", "dont", "asian", "any", "arts", "romanian", "damn", "dear", "re", "new", "world", "lebanese", "wait", "ah", "alternative", "confirm", "cross", "all", "so", "spanish", "regular", "do", "japanese", "bask", "modern", "regent", "turkey", "austro", "canape", "decide", "pollynasian", "thanks", "indo", "um", "take", "feed", "water", "foods", "choice", "on", "korean", "location", "telephone", "salad", "jamaican", "danish", "then", "steak", "code", "jesus", "but", "can", "sales", "moron", "mind", "endonesian", "pick", "find", "fOOD", "in", "next", "price", "venues", "well", "town", "crossover", "gastro", "gasper", "kosher", "believe", "appleton", "free", "class", "ran", "postcode", "bout", "german", "inaudible", "restuarant", "ok", "sigh", "train", "is", "downtown", "turk", "panasian", "rest", "british", "address", "holy", "italian", "pub", "matter", "selection", "halo", "ger", "scotch", "tow", "listen", "street", "vietnamese", "bra", "portuguese", "mail", "chinese", "good"]}